#region

using System;
using System.Collections.Generic;

#endregion

namespace xEngine.Common
{
    /// <summary>
    ///     随机字符串类
    /// </summary>
    public class RandStr
    {
        private static readonly Random R = new Random();

        #region 城市相关

        private static Dictionary<string, string[]> _dic;

        private static void Init1()
        {
            _dic = new Dictionary<string, string[]>
            {
                {
                    "0", new[]
                    {
                        "北京市", "天津市", "上海市", "重庆市", "河北省", "山西省", "内蒙古", "辽宁省", "吉林省", "黑龙江省", "江苏省", "浙江省", "安徽省",
                        "福建省",
                        "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "广西", "海南省", "四川省", "贵州省", "云南省", "西藏", "陕西省", "甘肃省",
                        "青海省", "宁夏", "新疆", "香港", "澳门", "台湾省"
                    }
                },
                {
                    "0_0_0", new[]
                    {
                        "东城区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区",
                        "大兴区",
                        "怀柔区", "平谷区", "密云县", "延庆县", "延庆镇"
                    }
                },
                {"0_0", new[] {"北京市"}},
                {
                    "0_1_0", new[]
                    {
                        "和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "津南区", "北辰区", "武清区",
                        "宝坻区",
                        "蓟县", "宁河县", "芦台镇", "静海县", "静海镇"
                    }
                },
                {"0_1", new[] {"天津市"}},
                {
                    "0_2_0", new[]
                    {
                        "黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区",
                        "金山区",
                        "松江区", "青浦区", "南汇区", "奉贤区", "崇明县", "城桥镇"
                    }
                },
                {"0_2", new[] {"上海市"}},
                {
                    "0_3_0", new[]
                    {
                        "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "万州区", "涪陵区",
                        "黔江区",
                        "长寿区", "合川市", "永川区市", "江津市", "南川市", "綦江县", "潼南县", "铜梁县", "大足县", "荣昌县", "璧山县", "垫江县", "武隆县",
                        "丰都县",
                        "城口县", "梁平县", "开县", "巫溪县", "巫山县", "奉节县", "云阳县", "忠县", "石柱土家族自治县", "彭水苗族土家族自治县", "酉阳土家族苗族自治县",
                        "秀山土家族苗族自治县"
                    }
                },
                {"0_3", new[] {"重庆市"}},
                {
                    "0_4_0", new[]
                    {
                        "长安区", "桥东区", "桥西区", "新华区", "裕华区", "井陉矿区", "辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市", "井陉县", "微水镇",
                        "正定县",
                        "正定镇", "栾城县", "栾城镇", "行唐县", "龙州镇", "灵寿县", "灵寿镇", "高邑县", "高邑镇", "深泽县", "深泽镇", "赞皇县", "赞皇镇", "无极县",
                        "无极镇", "平山县", "平山镇", "元氏县", "槐阳镇", "赵县", "赵州镇"
                    }
                },
                {
                    "0_4_1", new[]
                    {
                        "桥西区", "桥东区", "宣化区", "下花园区", "宣化县", "张家口市宣化区", "张北县", "张北镇", "康保县", "康保镇", "沽源县", "平定堡镇", "尚义县",
                        "南壕堑镇",
                        "蔚县", "蔚州镇", "阳原县", "西城镇", "怀安县", "柴沟堡镇", "万全县", "孔家庄镇", "怀来县", "沙城镇", "涿鹿县", "涿鹿镇", "赤城县",
                        "赤城镇",
                        "崇礼县", "西湾子镇"
                    }
                },
                {
                    "0_4_2", new[]
                    {
                        "双桥区", "双滦区", "鹰手营子矿区", "承德县", "下板城镇", "兴隆县", "兴隆镇", "平泉县", "平泉镇", "滦平县", "滦平镇", "隆化县", "隆化镇",
                        "丰宁满族自治县", "大阁镇", "宽城满族自治县", "宽城镇", "围场满族蒙古族自治县", "围场镇"
                    }
                },
                {"0_4_3", new[] {"海港区", "山海关区", "北戴河区", "昌黎县", "昌黎镇", "抚宁县", "抚宁镇", "卢龙县", "卢龙镇", "青龙满族自治县", "青龙镇"}},
                {
                    "0_4_4", new[]
                    {
                        "路北区", "路南区", "古冶区", "开平区", "丰润区", "丰南区", "遵化市", "迁安市", "滦县", "滦州镇", "滦南县", "倴城镇", "乐亭县", "乐亭镇",
                        "迁西县",
                        "兴城镇", "玉田县", "玉田镇", "唐海县", "唐海镇"
                    }
                },
                {
                    "0_4_5", new[]
                    {
                        "安次区", "广阳区", "霸州市", "三河市", "固安县", "固安镇", "永清县", "永清镇", "香河县", "淑阳镇", "大城县", "平舒镇", "文安县", "文安镇",
                        "大厂回族自治县", "大厂镇"
                    }
                },
                {
                    "0_4_6", new[]
                    {
                        "新市区", "北市区", "南市区", "定州市", "涿州市", "安国市", "高碑店市", "满城县", "满城镇", "清苑县", "清苑镇", "易县", "易州镇", "徐水县",
                        "安肃镇",
                        "涞源县", "涞源镇", "定兴县", "定兴镇", "顺平县", "蒲阳镇", "唐县", "仁厚镇", "望都县", "望都镇", "涞水县", "涞水镇", "高阳县", "高阳镇",
                        "安新县", "安新镇", "雄县", "雄州镇", "容城县", "容城镇", "曲阳县", "恒州镇", "阜平县", "阜平镇", "博野县", "博陵镇", "蠡县", "蠡吾镇"
                    }
                },
                {
                    "0_4_7", new[]
                    {
                        "桃城区", "冀州市", "深州市", "枣强县", "枣强镇", "武邑县", "武邑镇", "武强县", "武强镇", "饶阳县", "饶阳镇", "安平县", "安平镇", "故城县",
                        "郑口镇",
                        "景县", "景州镇", "阜城县", "阜城镇"
                    }
                },
                {
                    "0_4_8", new[]
                    {
                        "运河区", "新华区", "泊头市", "任丘市", "黄骅市", "河间市", "沧县", "沧州市新华区", "青县", "清州镇", "东光县", "东光镇", "海兴县",
                        "苏基镇",
                        "盐山县", "盐山镇", "肃宁县", "肃宁镇", "南皮县", "南皮镇", "吴桥县", "桑园镇", "献县", "乐寿镇", "孟村回族自治县", "孟村镇"
                    }
                },
                {
                    "0_4_9", new[]
                    {
                        "桥东区", "桥西区", "南宫市", "沙河市", "邢台县", "邢台市桥东区", "临城县", "临城镇", "内丘县", "内丘镇", "柏乡县", "柏乡镇", "隆尧县",
                        "隆尧镇",
                        "任县", "任城镇", "南和县", "和阳镇", "宁晋县", "凤凰镇", "巨鹿县", "巨鹿镇", "新河县", "新河镇", "广宗县", "广宗镇", "平乡县", "丰州镇",
                        "威县", "洺州镇", "清河县", "葛仙庄镇", "临西县", "临西镇"
                    }
                },
                {
                    "0_4_10", new[]
                    {
                        "丛台区", "邯山区", "复兴区", "峰峰矿区", "武安市", "邯郸县", "南堡乡东小屯村", "临漳县", "临漳镇", "成安县", "成安镇", "大名县", "大名镇",
                        "涉县",
                        "涉城镇", "磁县", "磁州镇", "肥乡县", "肥乡镇", "永年县", "临洺关镇", "邱县", "新马头镇", "鸡泽县", "鸡泽镇", "广平县", "广平镇", "馆陶县",
                        "馆陶镇", "魏县", "魏城镇", "曲周县", "曲周镇"
                    }
                },
                {"0_4", new[] {"石家庄市", "张家口市", "承德市", "秦皇岛市", "唐山市", "廊坊市", "保定市", "衡水市", "沧州市", "邢台市", "邯郸市"}},
                {
                    "0_5_0",
                    new[] {"杏花岭区", "小店区", "迎泽区", "尖草坪区", "万柏林区", "晋源区", "古交市", "清徐县", "清源镇", "阳曲县", "黄寨镇", "娄烦县", "娄烦镇"}
                },
                {"0_5_1", new[] {"朔城区", "平鲁区", "山阴县", "岱岳乡", "应县", "金城镇", "右玉县", "新城镇", "怀仁县", "云中镇"}},
                {
                    "0_5_2", new[]
                    {
                        "城区", "矿区", "南郊区", "新荣区", "阳高县", "龙泉镇", "天镇县", "玉泉镇", "广灵县", "壶泉镇", "灵丘县", "武灵镇", "浑源县", "永安镇",
                        "左云县",
                        "云兴镇", "大同县", "西坪镇"
                    }
                },
                {"0_5_3", new[] {"城区", "矿区", "郊区", "平定县", "冠山镇", "盂县", "秀水镇"}},
                {
                    "0_5_4", new[]
                    {
                        "城区", "郊区", "潞城市", "长治县", "韩店镇", "襄垣县", "古韩镇", "屯留县", "麟绛镇", "平顺县", "青羊镇", "黎城县", "黎侯镇", "壶关县",
                        "龙泉镇",
                        "长子县", "丹朱镇", "武乡县", "丰州镇", "沁县", "定昌镇", "沁源县", "沁河镇"
                    }
                },
                {"0_5_5", new[] {"城区", "高平市", "泽州县", "南村镇", "沁水县", "龙港镇", "阳城县", "凤城镇", "陵川县", "崇文镇"}},
                {
                    "0_5_6", new[]
                    {
                        "忻府区", "原平市", "定襄县", "晋昌镇", "五台县", "台城镇", "代县", "上馆镇", "繁峙县", "繁城镇", "宁武县", "凤凰镇", "静乐县", "鹅城镇",
                        "神池县",
                        "龙泉镇", "五寨县", "砚城镇", "岢岚县", "岚漪镇", "河曲县", "文笔镇", "保德县", "东关镇", "偏关县", "新关镇"
                    }
                },
                {
                    "0_5_7", new[]
                    {
                        "榆次区", "介休市", "榆社县", "箕城镇", "左权县", "辽阳镇", "和顺县", "义兴镇", "昔阳县", "乐平镇", "寿阳县", "朝阳镇", "太谷县", "明星镇",
                        "祁县",
                        "昭余镇", "平遥县", "古陶镇", "灵石县", "翠峰镇"
                    }
                },
                {
                    "0_5_8", new[]
                    {
                        "尧都区", "侯马市", "霍州市", "曲沃县", "乐昌镇", "翼城县", "唐兴镇", "襄汾县", "新城镇", "洪洞县", "大槐树镇", "古县", "岳阳镇", "安泽县",
                        "府城镇",
                        "浮山县", "天坛镇", "吉县", "吉昌镇", "乡宁县", "昌宁镇", "蒲县", "蒲城镇", "大宁县", "昕水镇", "永和县", "芝河镇", "隰县", "龙泉镇",
                        "汾西县",
                        "永安镇"
                    }
                },
                {
                    "0_5_9", new[]
                    {
                        "离石区", "孝义市", "汾阳市", "文水县", "凤城镇", "中阳县", "宁乡镇", "兴县", "蔚汾镇", "临县", "临泉镇", "方山县", "圪洞镇", "柳林县",
                        "柳林镇",
                        "岚县", "东村镇", "交口县", "水头镇", "交城县", "天宁镇", "石楼县", "灵泉镇"
                    }
                },
                {
                    "0_5_10", new[]
                    {
                        "盐湖区", "永济市", "河津市", "芮城县", "古魏镇", "临猗县", "猗氏镇", "万荣县", "解店镇", "新绛县", "龙兴镇", "稷山县", "稷峰镇", "闻喜县",
                        "桐城镇",
                        "夏县", "瑶峰镇", "绛县", "古绛镇", "平陆县", "圣人涧镇", "垣曲县", "新城镇"
                    }
                },
                {"0_5", new[] {"太原市", "朔州市", "大同市", "阳泉市", "长治市", "晋城市", "忻州市", "晋中市", "临汾市", "吕梁市", "运城市"}},
                {
                    "0_6_0", new[]
                    {
                        "回民区", "新城区", "玉泉区", "赛罕区", "托克托县", "双河镇", "武川县", "可可以力更镇", "和林格尔县", "城关镇", "清水河县", "城关镇",
                        "土默特左旗",
                        "察素齐镇"
                    }
                },
                {
                    "0_6_1",
                    new[]
                    {"昆都仑区", "东河区", "青山区", "石拐区", "白云矿区", "九原区", "固阳县", "金山镇", "土默特右旗", "萨拉齐镇", "达尔罕茂明安联合旗", "百灵庙镇"}
                },
                {"0_6_2", new[] {"海勃湾区", "海南区", "乌达区"}},
                {
                    "0_6_3", new[]
                    {
                        "红山区", "元宝山区", "松山区", "宁城县", "天义镇", "林西县", "林西镇", "阿鲁科尔沁旗", "天山镇", "巴林左旗", "林东镇", "巴林右旗", "大板镇",
                        "克什克腾旗", "经棚镇", "翁牛特旗", "乌丹镇", "喀喇沁旗", "锦山镇", "敖汉旗", "新惠镇"
                    }
                },
                {
                    "0_6_4", new[]
                    {
                        "科尔沁区", "霍林郭勒市", "开鲁县", "开鲁镇", "库伦旗", "库伦镇", "奈曼旗", "大沁他拉镇", "扎鲁特旗", "鲁北镇", "科尔沁左翼中旗", "保康镇",
                        "科尔沁左翼后旗",
                        "甘旗卡镇"
                    }
                },
                {
                    "0_6_5", new[]
                    {
                        "海拉尔区", "满洲里市", "扎兰屯市", "牙克石市", "根河市", "额尔古纳市", "阿荣旗", "那吉镇", "新巴尔虎右旗", "阿拉坦额莫勒镇", "新巴尔虎左旗",
                        "阿穆古郎镇",
                        "陈巴尔虎旗", "巴彦库仁镇", "鄂伦春自治旗", "阿里河镇", "鄂温克族自治旗", "巴彦托海镇", "莫力达瓦达斡尔族自治旗", "尼尔基镇"
                    }
                },
                {
                    "0_6_6", new[]
                    {
                        "东胜区", "达拉特旗", "树林召镇", "准格尔旗", "薛家湾镇", "鄂托克前旗", "敖勒召其镇", "鄂托克旗", "乌兰镇", "杭锦旗", "锡尼镇", "乌审旗",
                        "嘎鲁图镇",
                        "伊金霍洛旗", "阿勒腾席热镇"
                    }
                },
                {
                    "0_6_7", new[]
                    {
                        "集宁区", "丰镇市", "卓资县", "卓资山镇", "化德县", "长顺镇", "商都县", "商都镇", "兴和县", "城关镇", "凉城县", "岱海镇", "察哈尔右翼前旗",
                        "土贵乌拉镇",
                        "察哈尔右翼中旗", "科布尔镇", "察哈尔右翼后旗", "白音察干镇", "四子王旗", "乌兰花镇"
                    }
                },
                {
                    "0_6_8", new[]
                    {
                        "临河区", "五原县", "隆兴昌镇", "磴口县", "巴彦高勒镇", "乌拉特前旗", "乌拉山镇", "乌拉特中旗", "海流图镇", "乌拉特后旗", "巴音宝力格镇",
                        "杭锦后旗",
                        "陕坝镇"
                    }
                },
                {"0_6_9", new[] {"乌兰浩特市", "阿尔山市", "突泉县", "突泉镇", "科尔沁右翼前旗", "大坝沟镇", "科尔沁右翼中旗", "巴彦呼硕镇", "扎赉特旗", "音德尔镇"}},
                {
                    "0_6_10", new[]
                    {
                        "锡林浩特市", "二连浩特市", "多伦县", "多伦淖尔镇", "阿巴嘎旗", "别力古台镇", "苏尼特左旗", "满都拉图镇", "苏尼特右旗", "赛汉塔拉镇", "东乌珠穆沁旗",
                        "乌里雅斯太镇", "西乌珠穆沁旗", "巴拉嘎尔郭勒镇", "太仆寺旗", "宝昌镇", "镶黄旗", "新宝拉格镇", "正镶白旗", "明安图镇", "正蓝旗", "上都镇"
                    }
                },
                {"0_6_11", new[] {"巴彦浩特镇", "阿拉善右旗", "额肯呼都格镇", "额济纳旗", "达来呼布镇"}},
                {
                    "0_6",
                    new[]
                    {"呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "呼伦贝尔市", "鄂尔多斯市", "乌兰察布市", "巴彦淖尔市", "兴安盟", "锡林郭勒盟", "阿拉善盟"}
                },
                {
                    "0_7_0", new[]
                    {
                        "沈河区", "和平区", "大东区", "皇姑区", "铁西区", "苏家屯区", "东陵区", "新城子区", "于洪区", "新民市", "辽中县", "辽中镇", "康平县",
                        "康平镇",
                        "法库县", "法库镇"
                    }
                },
                {"0_7_1", new[] {"双塔区", "龙城区", "北票市", "凌源市", "朝阳县", "朝阳市双塔区", "建平县", "喀喇沁左翼蒙古族自治县", "大城子镇"}},
                {"0_7_2", new[] {"海州区", "新邱区", "太平区", "清河门区", "细河区", "彰武县", "彰武镇", "阜新蒙古族自治县", "阜新镇"}},
                {"0_7_3", new[] {"银州区", "清河区", "调兵山市", "开原市", "铁岭县", "铁岭市银州区", "西丰县", "西丰镇", "昌图县", "昌图镇"}},
                {"0_7_4", new[] {"顺城区", "新抚区", "东洲区", "望花区", "抚顺县", "抚顺市顺城区", "新宾满族自治县", "新宾镇", "清原满族自治县", "清原镇"}},
                {"0_7_5", new[] {"平山区", "溪湖区", "明山区", "南芬区", "本溪满族自治县", "小市镇", "桓仁满族自治县", "桓仁镇"}},
                {"0_7_6", new[] {"白塔区", "文圣区", "宏伟区", "弓长岭区", "太子河区", "灯塔市", "辽阳县", "首山镇"}},
                {"0_7_7", new[] {"铁东区", "铁西区", "立山区", "千山区", "海城市", "台安县", "台安镇", "岫岩满族自治县", "岫岩镇"}},
                {"0_7_8", new[] {"振兴区", "元宝区", "振安区", "凤城市", "东港市", "宽甸满族自治县", "宽甸镇"}},
                {"0_7_9", new[] {"西岗区", "中山区", "沙河口区", "甘井子区", "旅顺口区", "金州区", "瓦房店市", "普兰店市", "庄河市", "长海县", "大长山岛镇"}},
                {"0_7_10", new[] {"站前区", "西市区", "鲅鱼圈区", "老边区", "大石桥市", "盖州市"}},
                {"0_7_11", new[] {"兴隆台区", "双台子区", "大洼县", "大洼镇", "盘山县", "盘锦市双台子区"}},
                {"0_7_12", new[] {"太和区", "古塔区", "凌河区", "凌海市", "北宁市", "黑山县", "黑山镇", "义县", "义州镇"}},
                {"0_7_13", new[] {"龙港区", "连山区", "南票区", "兴城市", "绥中县", "绥中镇", "建昌县", "建昌镇"}},
                {
                    "0_7", new[]
                    {"沈阳市", "朝阳市", "阜新市", "铁岭市", "抚顺市", "本溪市", "辽阳市", "鞍山市", "丹东市", "大连市", "营口市", "盘锦市", "锦州市", "葫芦岛市"}
                },
                {"0_8_0", new[] {"朝阳区", "南关区", "宽城区", "二道区", "绿园区", "双阳区", "德惠市", "九台市", "榆树市", "农安县", "农安镇"}},
                {"0_8_1", new[] {"洮北区", "大安市", "洮南市", "镇赉县", "镇赉镇", "通榆县", "开通镇"}},
                {"0_8_2", new[] {"宁江区", "扶余县", "三岔河镇", "长岭县", "长岭镇", "乾安县", "乾安镇", "前郭尔罗斯蒙古族自治县", "前郭镇"}},
                {"0_8_3", new[] {"船营区", "龙潭区", "昌邑区", "丰满区", "磐石市", "蛟河市", "桦甸市", "舒兰市", "永吉县", "口前镇"}},
                {"0_8_4", new[] {"铁西区", "铁东区", "双辽市", "公主岭市", "梨树县", "梨树镇", "伊通满族自治县", "伊通镇"}},
                {"0_8_5", new[] {"龙山区", "西安区", "东丰县", "东丰镇", "东辽县", "白泉镇"}},
                {"0_8_6", new[] {"东昌区", "二道江区", "梅河口市", "集安市", "通化县", "快大茂镇", "辉南县", "朝阳镇", "柳河县", "柳河镇"}},
                {"0_8_7", new[] {"八道江区", "临江市", "江源县", "孙家堡子镇", "抚松县", "抚松镇", "靖宇县", "靖宇镇", "长白朝鲜族自治县", "长白镇"}},
                {"0_8_8", new[] {"延吉市", "图们市", "敦化市", "珲春市", "龙井市", "和龙市", "汪清县", "汪清镇", "安图县", "明月镇"}},
                {"0_8", new[] {"长春市", "白城市", "松原市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "延边州"}},
                {
                    "0_9_0", new[]
                    {
                        "松北区", "道里区", "南岗区", "道外区", "香坊区", "动力区", "平房区", "呼兰区", "双城市", "尚志市", "五常市", "阿城市", "依兰县", "依兰镇",
                        "方正县",
                        "方正镇", "宾县", "宾州镇", "巴彦县", "巴彦镇", "木兰县", "木兰镇", "通河县", "通河镇", "延寿县", "延寿镇"
                    }
                },
                {
                    "0_9_1", new[]
                    {
                        "建华区", "龙沙区", "铁锋区", "昂昂溪区", "富拉尔基区", "碾子山区", "梅里斯达斡尔族区", "讷河市", "龙江县", "龙江镇", "依安县", "依安镇",
                        "泰来县",
                        "泰来镇", "甘南县", "甘南镇", "富裕县", "富裕镇", "克山县", "克山镇", "克东县", "克东镇", "拜泉县", "拜泉镇"
                    }
                },
                {"0_9_2", new[] {"桃山区", "新兴区", "茄子河区", "勃利县", "勃利镇"}},
                {"0_9_3", new[] {"爱辉区", "北安市", "五大连池市", "嫩江县", "嫩江镇", "逊克县", "边疆镇", "孙吴县", "孙吴镇"}},
                {
                    "0_9_4", new[]
                    {"萨尔图区", "龙凤区", "让胡路区", "大同区", "红岗区", "肇州县", "肇州镇", "肇源县", "肇源镇", "林甸县", "林甸镇", "杜尔伯特蒙古族自治县", "泰康镇"}
                },
                {"0_9_5", new[] {"兴山区", "向阳区", "工农区", "南山区", "兴安区", "东山区", "萝北县", "凤翔镇", "绥滨县", "绥滨镇"}},
                {
                    "0_9_6", new[]
                    {
                        "伊春区", "南岔区", "友好区", "西林区", "翠峦区", "新青区", "美溪区", "金山屯区", "五营区", "乌马河区", "汤旺河区", "带岭区", "乌伊岭区",
                        "红星区",
                        "上甘岭区", "铁力市", "嘉荫县", "朝阳镇"
                    }
                },
                {
                    "0_9_7", new[]
                    {
                        "前进区", "永红区", "向阳区", "东风区", "郊区", "同江市", "富锦市", "桦南县", "桦南镇", "桦川县", "悦来镇", "汤原县", "汤原镇", "抚远县",
                        "抚远镇"
                    }
                },
                {"0_9_8", new[] {"尖山区", "岭东区", "四方台区", "宝山区", "集贤县", "福利镇", "友谊县", "友谊镇", "宝清县", "宝清镇", "饶河县", "饶河镇"}},
                {"0_9_9", new[] {"鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "麻山区", "虎林市", "密山市", "鸡东县", "鸡东镇"}},
                {"0_9_10", new[] {"爱民区", "东安区", "阳明区", "西安区", "穆棱市", "绥芬河市", "海林市", "宁安市", "东宁县", "东宁镇", "林口县", "林口镇"}},
                {
                    "0_9_11", new[]
                    {
                        "北林区", "安达市", "肇东市", "海伦市", "望奎县", "望奎镇", "兰西县", "兰西镇", "青冈县", "青冈镇", "庆安县", "庆安镇", "明水县", "明水镇",
                        "绥棱县",
                        "绥棱镇"
                    }
                },
                {"0_9_12", new[] {"呼玛县", "呼玛镇", "塔河县", "塔河镇", "漠河县", "西林吉镇"}},
                {
                    "0_9", new[]
                    {"哈尔滨市", "齐齐哈尔市", "七台河市", "黑河市", "大庆市", "鹤岗市", "伊春市", "佳木斯市", "双鸭山市", "鸡西市", "牡丹江市", "绥化市", "大兴安岭"}
                },
                {
                    "0_10_0", new[]
                    {
                        "玄武区", "白下区", "秦淮区", "建邺区", "鼓楼区", "下关区", "浦口区", "六合区", "栖霞区", "雨花台区", "江宁区", "溧水县", "永阳镇",
                        "高淳县",
                        "淳溪镇"
                    }
                },
                {
                    "0_10_1", new[]
                    {
                        "云龙区", "鼓楼区", "九里区", "贾汪区", "泉山区", "邳州市", "新沂市", "铜山县", "铜山镇", "睢宁县", "睢城镇", "沛县", "沛城镇", "丰县",
                        "凤城镇"
                    }
                },
                {"0_10_2", new[] {"新浦区", "连云区", "海州区", "赣榆县", "青口镇", "灌云县", "伊山镇", "东海县", "牛山镇", "灌南县", "新安镇"}},
                {"0_10_3", new[] {"宿城区", "宿豫区", "沭阳县", "沭城镇", "泗阳县", "众兴镇", "泗洪县", "青阳镇"}},
                {"0_10_4", new[] {"清河区", "清浦区", "楚州区", "淮阴区", "金湖县", "黎城镇", "盱眙县", "盱城镇", "洪泽县", "高良涧镇", "涟水县", "涟城镇"}},
                {
                    "0_10_5",
                    new[]
                    {"亭湖区", "盐都区", "东台市", "大丰市", "射阳县", "合德镇", "阜宁县", "阜城镇", "滨海县", "东坎镇", "响水县", "响水镇", "建湖县", "近湖镇"}
                },
                {"0_10_6", new[] {"维扬区", "广陵区", "邗江区", "仪征市", "江都市", "高邮市", "宝应县", "安宜镇"}},
                {"0_10_7", new[] {"海陵区", "高港区", "靖江市", "泰兴市", "姜堰市", "兴化市"}},
                {"0_10_8", new[] {"崇川区", "港闸区", "海门市", "启东市", "通州市", "如皋市", "如东县", "掘港镇", "海安县", "海安镇"}},
                {"0_10_9", new[] {"京口区", "润州区", "丹徒区", "扬中市", "丹阳市", "句容市"}},
                {"0_10_10", new[] {"钟楼区", "天宁区", "戚墅堰区", "新北区", "武进区", "金坛市", "溧阳市"}},
                {"0_10_11", new[] {"崇安区", "南长区", "北塘区", "滨湖区", "惠山区", "锡山区", "江阴市", "宜兴市"}},
                {"0_10_12", new[] {"金阊区", "沧浪区", "平江区", "虎丘区", "吴中区", "相城区", "吴江市", "昆山市", "太仓市", "常熟市", "张家港市"}},
                {
                    "0_10",
                    new[] {"南京市", "徐州市", "连云港市", "宿迁市", "淮安市", "盐城市", "扬州市", "泰州市", "南通市", "镇江市", "常州市", "无锡市", "苏州市"}
                },
                {
                    "0_11_0", new[]
                    {"拱墅区", "上城区", "下城区", "江干区", "西湖区", "滨江区", "余杭区", "萧山区", "临安市", "富阳市", "建德市", "桐庐县", "淳安县", "千岛湖镇"}
                },
                {"0_11_1", new[] {"吴兴区", "南浔区", "长兴县", "雉城镇", "德清县", "武康镇", "安吉县", "递铺镇"}},
                {"0_11_2", new[] {"南湖区", "秀洲区", "平湖市", "海宁市", "桐乡市", "嘉善县", "魏塘镇", "海盐县", "武原镇"}},
                {"0_11_3", new[] {"定海区", "普陀区", "岱山县", "高亭镇", "嵊泗县", "菜园镇"}},
                {"0_11_4", new[] {"海曙区", "江东区", "江北区", "北仑区", "镇海区", "鄞州区", "慈溪市", "余姚市", "奉化市", "宁海县", "象山县"}},
                {"0_11_5", new[] {"越城区", "诸暨市", "上虞市", "嵊州市", "绍兴县", "新昌县", "城关镇"}},
                {"0_11_6", new[] {"柯城区", "衢江区", "江山市", "常山县", "天马镇", "开化县", "城关镇", "龙游县"}},
                {"0_11_7", new[] {"婺城区", "金东区", "兰溪市", "永康市", "义乌市", "东阳市", "武义县", "浦江县", "磐安县", "安文镇"}},
                {"0_11_8", new[] {"椒江区", "黄岩区", "路桥区", "临海市", "温岭市", "三门县", "海游镇", "天台县", "仙居县", "玉环县", "珠港镇"}},
                {
                    "0_11_9", new[]
                    {
                        "鹿城区", "龙湾区", "瓯海区", "瑞安市", "乐清市", "永嘉县", "上塘镇", "文成县", "大峃镇", "平阳县", "昆阳镇", "泰顺县", "罗阳镇", "洞头县",
                        "北岙镇",
                        "苍南县", "灵溪镇"
                    }
                },
                {
                    "0_11_10", new[]
                    {
                        "莲都区", "龙泉市", "缙云县", "五云镇", "青田县", "鹤城镇", "云和县", "云和镇", "遂昌县", "妙高镇", "松阳县", "西屏镇", "庆元县", "松源镇",
                        "景宁畲族自治县", "鹤溪镇"
                    }
                },
                {"0_11", new[] {"杭州市", "湖州市", "嘉兴市", "舟山市", "宁波市", "绍兴市", "衢州市", "金华市", "台州市", "温州市", "丽水市"}},
                {"0_12_0", new[] {"庐阳区", "瑶海区", "蜀山区", "包河区", "长丰县", "水湖镇", "肥东县", "店埠镇", "肥西县", "上派镇"}},
                {"0_12_1", new[] {"埇桥区", "砀山县", "砀城镇", "萧县", "龙城镇", "灵璧县", "灵城镇", "泗县", "泗城镇"}},
                {"0_12_2", new[] {"相山区", "杜集区", "烈山区", "濉溪县", "濉溪镇"}},
                {"0_12_3", new[] {"谯城区", "涡阳县", "城关镇", "蒙城县", "城关镇", "利辛县", "城关镇"}},
                {"0_12_4", new[] {"颍州区", "颍东区", "颍泉区", "界首市", "临泉县", "城关镇", "太和县", "城关镇", "阜南县", "城关镇", "颍上县", "慎城镇"}},
                {"0_12_5", new[] {"蚌山区", "龙子湖区", "禹会区", "淮上区", "怀远县", "城关镇", "五河县", "城关镇", "固镇县", "城关镇"}},
                {"0_12_6", new[] {"田家庵区", "大通区", "谢家集区", "八公山区", "潘集区", "凤台县", "城关镇"}},
                {"0_12_7", new[] {"琅区", "南谯区", "明光市", "天长市", "来安县", "新安镇", "全椒县", "襄河镇", "定远县", "定城镇", "凤阳县", "府城镇"}},
                {"0_12_8", new[] {"雨山区", "花山区", "金家庄区", "当涂县", "姑孰镇"}},
                {"0_12_9", new[] {"镜湖区", "弋江区", "三山区", "鸠江区", "芜湖县", "湾镇", "繁昌县", "繁阳镇", "南陵县", "籍山镇"}},
                {"0_12_10", new[] {"铜官山区", "狮子山区", "郊区", "铜陵县", "五松镇"}},
                {
                    "0_12_11", new[]
                    {
                        "迎江区", "大观区", "宜秀区", "桐城市", "怀宁县", "高河镇", "枞阳县", "枞阳镇", "潜山县", "梅城镇", "太湖县", "晋熙镇", "宿松县", "孚玉镇",
                        "望江县",
                        "雷阳镇", "岳西县", "天堂镇"
                    }
                },
                {"0_12_12", new[] {"屯溪区", "黄山区", "徽州区", "歙县", "徽城镇", "休宁县", "海阳镇", "黟县", "碧阳镇", "祁门县", "祁山镇"}},
                {"0_12_13", new[] {"金安区", "裕安区", "寿县", "寿春镇", "霍邱县", "城关镇", "舒城县", "城关镇", "金寨县", "梅山镇", "霍山县", "衡山镇"}},
                {"0_12_14", new[] {"居巢区", "庐江县", "庐城镇", "无为县", "无城镇", "含山县", "环峰镇", "和县", "历阳镇"}},
                {"0_12_15", new[] {"贵池区", "东至县", "尧渡镇", "石台县", "七里镇", "青阳县", "蓉城镇"}},
                {"0_12_16", new[] {"宣州区", "宁国市", "郎溪县", "建平镇", "广德县", "桃州镇", "泾县", "泾川镇", "旌德县", "旌阳镇", "绩溪县", "华阳镇"}},
                {
                    "0_12", new[]
                    {
                        "合肥市", "宿州市", "淮北市", "亳州市", "阜阳市", "蚌埠市", "淮南市", "滁州市", "马鞍山市", "芜湖市", "铜陵市", "安庆市", "黄山市",
                        "六安市",
                        "巢湖市", "池州市", "宣城市"
                    }
                },
                {
                    "0_13_0", new[]
                    {
                        "鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "福清市", "长乐市", "闽侯县", "连江县", "凤城镇", "罗源县", "凤山镇", "闽清县", "梅城镇",
                        "永泰县",
                        "樟城镇", "平潭县", "潭城镇"
                    }
                },
                {
                    "0_13_1",
                    new[] {"延平区", "邵武市", "武夷山市", "建瓯市", "建阳市", "顺昌县", "浦城县", "光泽县", "杭川镇", "松溪县", "松源镇", "政和县", "熊山镇"}
                },
                {"0_13_2", new[] {"城厢区", "涵江区", "荔城区", "秀屿区", "仙游县"}},
                {
                    "0_13_3", new[]
                    {
                        "梅列区", "三元区", "永安市", "明溪县", "雪峰镇", "清流县", "龙津镇", "宁化县", "翠江镇", "大田县", "均溪镇", "尤溪县", "城关镇", "沙县",
                        "将乐县",
                        "古镛镇", "泰宁县", "杉城镇", "建宁县", "濉城镇"
                    }
                },
                {
                    "0_13_4", new[]
                    {
                        "鲤城区", "丰泽区", "洛江区", "泉港区", "石狮市", "晋江市", "南安市", "惠安县", "螺城镇", "安溪县", "凤城镇", "永春县", "桃城镇", "德化县",
                        "浔中镇",
                        "金门县", "☆"
                    }
                },
                {"0_13_5", new[] {"思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区"}},
                {
                    "0_13_6", new[]
                    {
                        "芗城区", "龙文区", "龙海市", "云霄县", "云陵镇", "漳浦县", "绥安镇", "诏安县", "南诏镇", "长泰县", "武安镇", "东山县", "西埔镇", "南靖县",
                        "山城镇",
                        "平和县", "小溪镇", "华安县", "华丰镇"
                    }
                },
                {"0_13_7", new[] {"新罗区", "漳平市", "长汀县", "汀州镇", "永定县", "凤城镇", "上杭县", "临江镇", "武平县", "平川镇", "连城县", "莲峰镇"}},
                {
                    "0_13_8",
                    new[] {"蕉城区", "福安市", "福鼎市", "寿宁县", "鳌阳镇", "霞浦县", "柘荣县", "双城镇", "屏南县", "古峰镇", "古田县", "周宁县", "狮城镇"}
                },
                {"0_13", new[] {"福州市", "南平市", "莆田市", "三明市", "泉州市", "厦门市", "漳州市", "龙岩市", "宁德市"}},
                {
                    "0_14_0",
                    new[] {"东湖区", "西湖区", "青云谱区", "湾里区", "青山湖区", "南昌县", "莲塘镇", "新建县", "长堎镇", "安义县", "龙津镇", "进贤县", "民和镇"}
                },
                {
                    "0_14_1", new[]
                    {
                        "浔阳区", "庐山区", "瑞昌市", "九江县", "沙河街镇", "武宁县", "新宁镇", "修水县", "义宁镇", "永修县", "涂埠镇", "德安县", "蒲亭镇",
                        "星子县",
                        "南康镇", "都昌县", "都昌镇", "湖口县", "双钟镇", "彭泽县", "龙城镇"
                    }
                },
                {"0_14_2", new[] {"珠山区", "昌江区", "乐平市", "浮梁县", "浮梁镇"}},
                {"0_14_3", new[] {"月湖区", "贵溪市", "余江县", "邓埠镇"}},
                {"0_14_4", new[] {"渝水区", "分宜县", "分宜镇"}},
                {"0_14_5", new[] {"安源区", "湘东区", "莲花县", "琴亭镇", "上栗县", "上栗镇", "芦溪县", "芦溪镇"}},
                {
                    "0_14_6", new[]
                    {
                        "章贡区", "瑞金市", "南康市", "赣县", "梅林镇", "信丰县", "嘉定镇", "大余县", "南安镇", "上犹县", "东山镇", "崇义县", "横水镇", "安远县",
                        "欣山镇",
                        "龙南县", "龙南镇", "定南县", "历市镇", "全南县", "城厢镇", "宁都县", "梅江镇", "于都县", "贡江镇", "兴国县", "潋江镇", "会昌县",
                        "文武坝镇",
                        "寻乌县", "长宁镇", "石城县", "琴江镇"
                    }
                },
                {
                    "0_14_7", new[]
                    {
                        "信州区", "德兴市", "上饶县", "旭日镇", "广丰县", "永丰镇", "玉山县", "冰溪镇", "铅山县", "河口镇", "横峰县", "岑阳镇", "弋阳县", "弋江镇",
                        "余干县",
                        "玉亭镇", "鄱阳县", "鄱阳镇", "万年县", "陈营镇", "婺源县", "紫阳镇"
                    }
                },
                {
                    "0_14_8", new[]
                    {
                        "临川区", "南城县", "建昌镇", "黎川县", "日峰镇", "南丰县", "琴城镇", "崇仁县", "巴山镇", "乐安县", "鳌溪镇", "宜黄县", "凤冈镇", "金溪县",
                        "秀谷镇",
                        "资溪县", "鹤城镇", "东乡县", "孝岗镇", "广昌县", "旴江镇"
                    }
                },
                {
                    "0_14_9",
                    new[]
                    {"袁州区", "丰城市", "樟树市", "高安市", "奉新县", "冯川镇", "万载县", "上高县", "宜丰县", "新昌镇", "靖安县", "双溪镇", "铜鼓县", "永宁镇"}
                },
                {
                    "0_14_10", new[]
                    {
                        "吉州区", "青原区", "井冈山市", "厦坪镇", "吉安县", "敦厚镇", "吉水县", "文峰镇", "峡江县", "水边镇", "新干县", "金川镇", "永丰县",
                        "恩江镇",
                        "泰和县", "澄江镇", "遂川县", "泉江镇", "万安县", "芙蓉镇", "安福县", "平都镇", "永新县", "禾川镇"
                    }
                },
                {"0_14", new[] {"南昌市", "九江市", "景德镇市", "鹰潭市", "新余市", "萍乡市", "赣州市", "上饶市", "抚州市", "宜春市", "吉安市"}},
                {"0_15_0", new[] {"市中区", "历下区", "槐荫区", "天桥区", "历城区", "长清区", "章丘市", "平阴县", "平阴镇", "济阳县", "济阳镇", "商河县"}},
                {"0_15_1", new[] {"市南区", "市北区", "四方区", "黄岛区", "崂山区", "城阳区", "李沧区", "胶州市", "即墨市", "平度市", "胶南市", "莱西市"}},
                {"0_15_2", new[] {"东昌府区", "临清市", "阳谷县", "莘县", "茌平县", "东阿县", "冠县", "冠城镇", "高唐县"}},
                {
                    "0_15_3", new[]
                    {
                        "德城区", "乐陵市", "禹城市", "陵县", "陵城镇", "平原县", "夏津县", "夏津镇", "武城县", "武城镇", "齐河县", "晏城镇", "临邑县", "宁津县",
                        "宁津镇",
                        "庆云县", "庆云镇"
                    }
                },
                {"0_15_4", new[] {"东营区", "河口区", "垦利县", "垦利镇", "利津县", "利津镇", "广饶县", "广饶镇"}},
                {"0_15_5", new[] {"张店区", "淄川区", "博山区", "临淄区", "周村区", "桓台县", "索镇", "高青县", "田镇", "沂源县", "南麻镇"}},
                {"0_15_6", new[] {"潍城区", "寒亭区", "坊子区", "奎文区", "安丘市", "昌邑市", "高密市", "青州市", "诸城市", "寿光市", "临朐县", "昌乐县"}},
                {
                    "0_15_7",
                    new[] {"莱山区", "芝罘区", "福山区", "牟平区", "栖霞市", "海阳市", "龙口市", "莱阳市", "莱州市", "蓬莱市", "招远市", "长岛县", "南长山镇"}
                },
                {"0_15_8", new[] {"环翠区", "荣成市", "乳山市", "文登市"}},
                {"0_15_9", new[] {"东港区", "岚山区", "五莲县", "洪凝镇", "莒县", "城阳镇"}},
                {
                    "0_15_10", new[]
                    {
                        "兰山区", "罗庄区", "河东区", "郯城县", "郯城镇", "苍山县", "卞庄镇", "莒南县", "十字路镇", "沂水县", "沂水镇", "蒙阴县", "蒙阴镇",
                        "平邑县",
                        "平邑镇", "费县", "费城镇", "沂南县", "界湖镇", "临沭县", "临沭镇"
                    }
                },
                {"0_15_11", new[] {"薛城区", "市中区", "峄城区", "台儿庄区", "山亭区", "滕州市"}},
                {
                    "0_15_12", new[]
                    {
                        "市中区", "任城区", "曲阜市", "兖州市", "邹城市", "微山县", "鱼台县", "谷亭镇", "金乡县", "金乡镇", "嘉祥县", "嘉祥镇", "汶上县", "汶上镇",
                        "泗水县",
                        "梁山县", "梁山镇"
                    }
                },
                {"0_15_13", new[] {"泰山区", "岱岳区", "新泰市", "肥城市", "宁阳县", "宁阳镇", "东平县", "东平镇"}},
                {"0_15_14", new[] {"莱城区", "钢城区"}},
                {"0_15_15", new[] {"滨城区", "惠民县", "惠民镇", "阳信县", "阳信镇", "无棣县", "无棣镇", "沾化县", "富国镇", "博兴县", "博兴镇", "邹平县"}},
                {
                    "0_15_16", new[]
                    {
                        "牡丹区", "曹县", "曹城镇", "定陶县", "定陶镇", "成武县", "成武镇", "单县", "单城镇", "巨野县", "巨野镇", "郓城县", "郓城镇", "鄄城县",
                        "鄄城镇",
                        "东明县", "城关镇"
                    }
                },
                {
                    "0_15", new[]
                    {
                        "济南市", "青岛市", "聊城市", "德州市", "东营市", "淄博市", "潍坊市", "烟台市", "威海市", "日照市", "临沂市", "枣庄市", "济宁市", "泰安市",
                        "莱芜市",
                        "滨州市", "菏泽市"
                    }
                },
                {
                    "0_16_0",
                    new[] {"中原区", "二七区", "管城回族区", "金水区", "上街区", "惠济区", "新郑市", "登封市", "新密市", "巩义市", "荥阳市", "中牟县", "城关镇"}
                },
                {
                    "0_16_1", new[]
                    {
                        "鼓楼区", "龙亭区", "顺河回族区", "禹王台区", "金明区", "杞县", "城关镇", "通许县", "城关镇", "尉氏县", "城关镇", "开封县", "城关镇",
                        "兰考县",
                        "城关镇"
                    }
                },
                {"0_16_2", new[] {"湖滨区", "义马市", "灵宝市", "渑池县", "城关镇", "陕县", "大营镇", "卢氏县", "城关镇"}},
                {
                    "0_16_3", new[]
                    {
                        "西工区", "老城区", "瀍河回族区", "涧西区", "吉利区", "洛龙区", "偃师市", "孟津县", "城关镇", "新安县", "城关镇", "栾川县", "城关镇",
                        "嵩县",
                        "城关镇", "汝阳县", "城关镇", "宜阳县", "城关镇", "洛宁县", "城关镇", "伊川县", "城关镇"
                    }
                },
                {
                    "0_16_4",
                    new[]
                    {"解放区", "山阳区", "中站区", "马村区", "孟州市", "沁阳市", "修武县", "城关镇", "博爱县", "清化镇", "武陟县", "木城镇", "温县", "温泉镇"}
                },
                {
                    "0_16_5", new[]
                    {
                        "卫滨区", "红旗区", "凤泉区", "牧野区", "卫辉市", "辉县市", "新乡县", "新乡市红旗区", "获嘉县", "城关镇", "原阳县", "城关镇", "延津县",
                        "城关镇",
                        "封丘县", "城关镇", "长垣县", "城关镇"
                    }
                },
                {"0_16_6", new[] {"淇滨区", "山城区", "鹤山区", "浚县", "城关镇", "淇县", "朝歌镇"}},
                {
                    "0_16_7",
                    new[] {"北关区", "文峰区", "殷都区", "龙安区", "林州市", "安阳县", "安阳市北关区", "汤阴县", "城关镇", "滑县", "道口镇", "内黄县", "城关镇"}
                },
                {"0_16_8", new[] {"华龙区", "清丰县", "城关镇", "南乐县", "城关镇", "范县", "城关镇", "台前县", "城关镇", "濮阳县", "城关镇"}},
                {
                    "0_16_9", new[]
                    {
                        "梁园区", "睢阳区", "永城市", "虞城县", "城关镇", "民权县", "城关镇", "宁陵县", "城关镇", "睢县", "城关镇", "夏邑县", "城关镇", "柘城县",
                        "城关镇"
                    }
                },
                {"0_16_10", new[] {"魏都区", "禹州市", "长葛市", "许昌县", "许昌市魏都区", "鄢陵县", "安陵镇", "襄城县", "城关镇"}},
                {"0_16_11", new[] {"源汇区", "郾城区", "召陵区", "舞阳县", "舞泉镇", "临颍县", "城关镇"}},
                {
                    "0_16_12",
                    new[]
                    {"新华区", "卫东区", "湛河区", "石龙区", "舞钢市", "汝州市", "宝丰县", "城关镇", "叶县", "昆阳镇", "鲁山县", "鲁阳镇", "郏县", "城关镇"}
                },
                {
                    "0_16_13", new[]
                    {
                        "卧龙区", "宛城区", "邓州市", "南召县", "城关镇", "方城县", "城关镇", "西峡县", "镇平县", "城关镇", "内乡县", "城关镇", "淅川县", "社旗县",
                        "赊店镇",
                        "唐河县", "新野县", "城关镇", "桐柏县", "城关镇"
                    }
                },
                {
                    "0_16_14", new[]
                    {
                        "河区", "平桥区", "息县", "城关镇", "淮滨县", "城关镇", "潢川县", "光山县", "固始县", "城关镇", "商城县", "城关镇", "罗山县", "城关镇",
                        "新县",
                        "新集镇"
                    }
                },
                {
                    "0_16_15", new[]
                    {
                        "川汇区", "项城市", "扶沟县", "城关镇", "西华县", "城关镇", "商水县", "城关镇", "太康县", "城关镇", "鹿邑县", "城关镇", "郸城县", "城关镇",
                        "淮阳县",
                        "城关镇", "沈丘县", "槐店镇"
                    }
                },
                {
                    "0_16_16", new[]
                    {
                        "驿城区", "确山县", "盘龙镇", "泌阳县", "泌水镇", "遂平县", "灈阳镇", "西平县", "上蔡县", "蔡都镇", "汝南县", "汝宁镇", "平舆县", "古槐镇",
                        "新蔡县",
                        "古吕镇", "正阳县", "真阳镇"
                    }
                },
                {
                    "0_16", new[]
                    {
                        "郑州市", "开封市", "三门峡市", "洛阳市", "焦作市", "新乡市", "鹤壁市", "安阳市", "濮阳市", "商丘市", "许昌市", "漯河市", "平顶山市",
                        "南阳市",
                        "信阳市", "周口市", "驻马店市", "济源市"
                    }
                },
                {
                    "0_17_0",
                    new[] {"江岸区", "江汉区", "硚口区", "汉阳区", "武昌区", "青山区", "洪山区", "东西湖区", "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区"}
                },
                {
                    "0_17_1",
                    new[] {"张湾区", "茅箭区", "丹江口市", "郧县", "城关镇", "竹山县", "城关镇", "房县", "城关镇", "郧西县", "城关镇", "竹溪县", "城关镇"}
                },
                {"0_17_2", new[] {"襄城区", "樊城区", "襄阳区", "老河口市", "枣阳市", "宜城市", "南漳县", "城关镇", "谷城县", "城关镇", "保康县", "城关镇"}},
                {"0_17_3", new[] {"东宝区", "掇刀区", "钟祥市", "沙洋县", "沙洋镇", "京山县", "新市镇"}},
                {"0_17_4", new[] {"孝南区", "应城市", "安陆市", "汉川市", "孝昌县", "花园镇", "大悟县", "城关镇", "云梦县", "城关镇"}},
                {
                    "0_17_5", new[]
                    {
                        "黄州区", "麻城市", "武穴市", "红安县", "城关镇", "罗田县", "凤山镇", "英山县", "温泉镇", "浠水县", "清泉镇", "蕲春县", "漕河镇", "黄梅县",
                        "黄梅镇",
                        "团风县", "团风镇"
                    }
                },
                {"0_17_6", new[] {"鄂城区", "梁子湖区", "华容区"}},
                {"0_17_7", new[] {"黄石港区", "西塞山区", "下陆区", "铁山区", "大冶市", "阳新县", "兴国镇"}},
                {"0_17_8", new[] {"咸安区", "赤壁市", "嘉鱼县", "鱼岳镇", "通城县", "隽水镇", "崇阳县", "天城镇", "通山县", "通羊镇"}},
                {"0_17_9", new[] {"沙市区", "荆州区", "石首市", "洪湖市", "松滋市", "江陵县", "郝穴镇", "公安县", "斗湖堤镇", "监利县", "容城镇"}},
                {
                    "0_17_10", new[]
                    {
                        "西陵区", "伍家岗区", "点军区", "猇亭区", "夷陵区", "枝江市", "宜都市", "当阳市", "远安县", "鸣凤镇", "兴山县", "古夫镇", "秭归县",
                        "茅坪镇",
                        "长阳土家族自治县", "龙舟坪镇", "五峰土家族自治县", "五峰镇"
                    }
                },
                {"0_17_11", new[] {"曾都区", "广水市"}},
                {"0_17_12", new[] {"仙桃市", "天门市", "潜江市", "神农架林区", "松柏镇"}},
                {
                    "0_17_13", new[]
                    {"恩施市", "利川市", "建始县", "业州镇", "巴东县", "信陵镇", "宣恩县", "珠山镇", "咸丰县", "高乐山镇", "来凤县", "翔凤镇", "鹤峰县", "容美镇"}
                },
                {
                    "0_17", new[]
                    {
                        "武汉市", "十堰市", "襄樊市", "荆门市", "孝感市", "黄冈市", "鄂州市", "黄石市", "咸宁市", "荆州市", "宜昌市", "随州市", "省直辖县级行政单位",
                        "恩施州"
                    }
                },
                {
                    "0_18_0",
                    new[] {"长沙市", "岳麓区", "芙蓉区", "天心区", "开福区", "雨花区", "浏阳市", "长沙县", "星沙镇", "望城县", "高塘岭镇", "宁乡县", "玉潭镇"}
                },
                {"0_18_1", new[] {"永定区", "武陵源区", "慈利县", "零阳镇", "桑植县", "澧源镇"}},
                {
                    "0_18_2", new[]
                    {
                        "武陵区", "鼎城区", "津市市", "安乡县", "城关镇", "汉寿县", "龙阳镇", "澧县", "澧阳镇", "临澧县", "安福镇", "桃源县", "漳江镇", "石门县",
                        "楚江镇"
                    }
                },
                {"0_18_3", new[] {"赫山区", "资阳区", "沅江市", "南县", "南洲镇", "桃江县", "桃花江镇", "安化县", "东坪镇"}},
                {
                    "0_18_4",
                    new[] {"岳阳楼区", "君山区", "云溪区", "汨罗市", "临湘市", "岳阳县", "荣家湾镇", "华容县", "城关镇", "湘阴县", "文星镇", "平江县", "汉昌镇"}
                },
                {
                    "0_18_5",
                    new[] {"天元区", "荷塘区", "芦淞区", "石峰区", "醴陵市", "株洲县", "渌口镇", "攸县", "城关镇", "茶陵县", "城关镇", "炎陵县", "霞阳镇"}
                },
                {"0_18_6", new[] {"岳塘区", "雨湖区", "湘乡市", "韶山市", "湘潭县", "易俗河镇"}},
                {
                    "0_18_7", new[]
                    {
                        "雁峰区", "珠晖区", "石鼓区", "蒸湘区", "南岳区", "常宁市", "耒阳市", "衡阳县", "西渡镇", "衡南县", "云集镇", "衡山县", "开云镇", "衡东县",
                        "城关镇",
                        "祁东县", "洪桥镇"
                    }
                },
                {
                    "0_18_8", new[]
                    {
                        "北湖区", "苏仙区", "资兴市", "桂阳县", "城关镇", "永兴县", "城关镇", "宜章县", "城关镇", "嘉禾县", "城关镇", "临武县", "城关镇", "汝城县",
                        "城关镇",
                        "桂东县", "城关镇", "安仁县", "城关镇"
                    }
                },
                {
                    "0_18_9", new[]
                    {
                        "冷水滩区", "零陵区", "东安县", "白牙市镇", "道县", "道江镇", "宁远县", "舜陵镇", "江永县", "潇浦镇", "蓝山县", "塔峰镇", "新田县",
                        "龙泉镇",
                        "双牌县", "泷泊镇", "祁阳县", "浯溪镇", "江华瑶族自治县", "沱江镇"
                    }
                },
                {
                    "0_18_10", new[]
                    {
                        "双清区", "大祥区", "北塔区", "武冈市", "邵东县", "两市镇", "邵阳县", "塘渡口镇", "新邵县", "酿溪镇", "隆回县", "桃洪镇", "洞口县",
                        "洞口镇",
                        "绥宁县", "长铺镇", "新宁县", "金石镇", "城步苗族自治县", "儒林镇"
                    }
                },
                {
                    "0_18_11", new[]
                    {
                        "鹤城区", "洪江市", "沅陵县", "沅陵镇", "辰溪县", "辰阳镇", "溆浦县", "卢峰镇", "中方县", "中方镇", "会同县", "林城镇", "麻阳苗族自治县",
                        "高村镇",
                        "新晃侗族自治县", "新晃镇", "芷江侗族自治县", "芷江镇", "靖州苗族侗族自治县", "渠阳镇", "通道侗族自治县", "双江镇"
                    }
                },
                {"0_18_12", new[] {"娄星区", "冷水江市", "涟源市", "双峰县", "永丰镇", "新化县", "上梅镇"}},
                {
                    "0_18_13",
                    new[]
                    {"吉首市", "泸溪县", "白沙镇", "凤凰县", "沱江镇", "花垣县", "花垣镇", "保靖县", "迁陵镇", "古丈县", "古阳镇", "永顺县", "灵溪镇", "龙山县"}
                },
                {
                    "0_18", new[]
                    {"长沙市", "张家界市", "常德市", "益阳市", "岳阳市", "株洲市", "湘潭市", "衡阳市", "郴州市", "永州市", "邵阳市", "怀化市", "娄底市", "湘西州"}
                },
                {"0_19_0", new[] {"越秀区", "荔湾区", "海珠区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "南沙区", "萝岗区", "增城市", "从化市"}},
                {"0_19_1", new[] {"福田区", "罗湖区", "南山区", "宝安区", "龙岗区", "盐田区"}},
                {
                    "0_19_2", new[]
                    {
                        "清城区", "英德市", "连州市", "佛冈县", "石角镇", "阳山县", "阳城镇", "清新县", "太和镇", "连山壮族瑶族自治县", "吉田镇", "连南瑶族自治县",
                        "三江镇"
                    }
                },
                {
                    "0_19_3", new[]
                    {
                        "浈江区", "武江区", "曲江区", "乐昌市", "南雄市", "始兴县", "太平镇", "仁化县", "仁化镇", "翁源县", "龙仙镇", "新丰县", "乳源瑶族自治县",
                        "乳城镇"
                    }
                },
                {"0_19_4", new[] {"源城区", "紫金县", "紫城镇", "龙川县", "老隆镇", "连平县", "元善镇", "和平县", "阳明镇", "东源县", "仙塘镇"}},
                {
                    "0_19_5",
                    new[]
                    {"梅江区", "兴宁市", "梅县", "程江镇", "大埔县", "湖寮镇", "丰顺县", "汤坑镇", "五华县", "水寨镇", "平远县", "大柘镇", "蕉岭县", "蕉城镇"}
                },
                {"0_19_6", new[] {"湘桥区", "潮安县", "庵埠镇", "饶平县", "黄冈镇"}},
                {"0_19_7", new[] {"金平区", "濠江区", "龙湖区", "潮阳区", "潮南区", "澄海区", "南澳县", "后宅镇"}},
                {"0_19_8", new[] {"榕城区", "普宁市", "揭东县", "曲溪镇", "揭西县", "河婆镇", "惠来县", "惠城镇"}},
                {"0_19_9", new[] {"城区", "陆丰市", "海丰县", "海城镇", "陆河县", "河田镇"}},
                {"0_19_10", new[] {"惠城区", "惠阳区", "博罗县", "罗阳镇", "惠东县", "龙门县"}},
                {"0_19_12", new[] {"香洲区", "斗门区", "金湾区"}},
                {"0_19_14", new[] {"江海区", "蓬江区", "新会区", "恩平市", "台山市", "开平市", "鹤山市"}},
                {"0_19_15", new[] {"禅城区", "南海区", "顺德区", "三水区", "高明区"}},
                {"0_19_16", new[] {"端州区", "鼎湖区", "高要市", "四会市", "广宁县", "南街镇", "怀集县", "怀城镇", "封开县", "江口镇", "德庆县"}},
                {"0_19_17", new[] {"云城区", "罗定市", "云安县", "六都镇", "新兴县", "新城镇", "郁南县", "都城镇"}},
                {"0_19_18", new[] {"江城区", "阳春市", "阳西县", "织镇", "阳东县", "东城镇"}},
                {"0_19_19", new[] {"茂南区", "茂港区", "化州市", "信宜市", "高州市", "电白县", "水东镇"}},
                {
                    "0_19_20", new[]
                    {
                        "赤坎区", "霞山区", "坡头区", "麻章区", "吴川市", "廉江市", "雷州市", "遂溪县", "遂城镇", "徐闻县", "撤销广州市东山区", "芳村区",
                        "设立广州市南沙区",
                        "萝岗区"
                    }
                },
                {
                    "0_19", new[]
                    {
                        "广州市", "深圳市", "清远市", "韶关市", "河源市", "梅州市", "潮州市", "汕头市", "揭阳市", "汕尾市", "惠州市", "东莞市", "珠海市", "中山市",
                        "江门市",
                        "佛山市", "肇庆市", "云浮市", "阳江市", "茂名市", "湛江市"
                    }
                },
                {"0_20_0", new[] {"青秀区", "兴宁区", "江南区", "西乡塘区", "良庆区", "邕宁区", "武鸣县", "横县", "宾阳县", "上林县", "隆安县", "马山县"}},
                {
                    "0_20_1", new[]
                    {
                        "象山区", "叠彩区", "秀峰区", "七星区", "雁山区", "阳朔县", "阳朔镇", "临桂县", "临桂镇", "灵川县", "灵川镇", "全州县", "全州镇", "兴安县",
                        "兴安镇",
                        "永福县", "永福镇", "灌阳县", "灌阳镇", "资源县", "资源镇", "平乐县", "平乐镇", "荔浦县", "荔城镇", "龙胜各族自治县", "龙胜镇",
                        "恭城瑶族自治县",
                        "恭城镇"
                    }
                },
                {
                    "0_20_2", new[]
                    {
                        "城中区", "鱼峰区", "柳南区", "柳北区", "柳江县", "拉堡镇", "柳城县", "大埔镇", "鹿寨县", "鹿寨镇", "融安县", "长安镇", "三江侗族自治县",
                        "古宜镇",
                        "融水苗族自治县", "融水镇"
                    }
                },
                {"0_20_3", new[] {"万秀区", "蝶山区", "长洲区", "岑溪市", "苍梧县", "龙圩镇", "藤县", "藤州镇", "蒙山县", "蒙山镇"}},
                {"0_20_4", new[] {"港北区", "港南区", "覃塘区", "桂平市", "平南县", "平南镇"}},
                {"0_20_5", new[] {"玉州区", "北流市", "兴业县", "石南镇", "容县", "容州镇", "陆川县", "陆城镇", "博白县", "博白镇"}},
                {"0_20_6", new[] {"钦南区", "钦北区", "灵山县", "灵城镇", "浦北县", "小江镇"}},
                {"0_20_7", new[] {"海城区", "银海区", "铁山港区", "合浦县", "廉州镇"}},
                {"0_20_8", new[] {"港口区", "防城区", "东兴市", "上思县", "思阳镇"}},
                {"0_20_9", new[] {"江州区", "凭祥市", "扶绥县", "新宁镇", "大新县", "桃城镇", "天等县", "天等镇", "宁明县", "城中镇", "龙州县", "龙州镇"}},
                {
                    "0_20_10", new[]
                    {
                        "右江区", "田阳县", "田州镇", "田东县", "平马镇", "平果县", "马头镇", "德保县", "城关镇", "靖西县", "新靖镇", "那坡县", "城厢镇", "凌云县",
                        "泗城镇",
                        "乐业县", "同乐镇", "西林县", "八达镇", "田林县", "乐里镇", "隆林各族自治县", "新州镇"
                    }
                },
                {
                    "0_20_11", new[]
                    {
                        "金城江区", "宜州市", "南丹县", "城关镇", "天峨县", "六排镇", "凤山县", "凤城镇", "东兰县", "东兰镇", "巴马瑶族自治县", "巴马镇",
                        "都安瑶族自治县",
                        "安阳镇", "大化瑶族自治县", "大化镇", "罗城仫佬族自治县", "东门镇", "环江毛南族自治县", "思恩镇"
                    }
                },
                {"0_20_12", new[] {"兴宾区", "合山市", "象州县", "象州镇", "武宣县", "武宣镇", "忻城县", "城关镇", "金秀瑶族自治县", "金秀镇"}},
                {"0_20_13", new[] {"八步区", "昭平县", "昭平镇", "钟山县", "钟山镇", "富川瑶族自治县", "富阳镇"}},
                {
                    "0_20", new[]
                    {"南宁市", "桂林市", "柳州市", "梧州市", "贵港市", "玉林市", "钦州市", "北海市", "防城港市", "崇左市", "百色市", "河池市", "来宾市", "贺州市"}
                },
                {"0_21_0", new[] {"龙华区", "秀英区", "琼山区", "美兰区"}},
                {
                    "0_21_2", new[]
                    {
                        "文昌市", "琼海市", "万宁市", "五指山市", "东方市", "儋州市", "临高县", "临城镇", "澄迈县", "金江镇", "定安县", "定城镇", "屯昌县",
                        "屯城镇",
                        "昌江黎族自治县", "石碌镇", "白沙黎族自治县", "牙叉镇", "琼中黎族苗族自治县", "营根镇", "陵水黎族自治县", "椰林镇", "保亭黎族苗族自治县", "保城镇",
                        "乐东黎族自治县", "抱由镇"
                    }
                },
                {"0_21", new[] {"海口市", "三亚市", "省直辖行政单位"}},
                {
                    "0_22_0", new[]
                    {
                        "青羊区", "锦江区", "金牛区", "武侯区", "成华区", "龙泉驿区", "青白江区", "新都区", "温江区", "都江堰市", "彭州市", "邛崃市", "崇州市",
                        "金堂县",
                        "赵镇", "双流县", "郫县", "郫筒镇", "大邑县", "晋原镇", "蒲江县", "鹤山镇", "新津县", "五津镇"
                    }
                },
                {"0_22_1", new[] {"市中区", "元坝区", "朝天区", "旺苍县", "东河镇", "青川县", "乔庄镇", "剑阁县", "下寺镇", "苍溪县", "陵江镇"}},
                {
                    "0_22_2", new[]
                    {
                        "涪城区", "游仙区", "江油市", "三台县", "潼川镇", "盐亭县", "云溪镇", "安县", "花荄镇", "梓潼县", "文昌镇", "北川羌族自治县", "曲山镇",
                        "平武县",
                        "龙安镇"
                    }
                },
                {"0_22_3", new[] {"旌阳区", "什邡市", "广汉市", "绵竹市", "罗江县", "罗江镇", "中江县", "凯江镇"}},
                {
                    "0_22_4",
                    new[]
                    {"顺庆区", "高坪区", "嘉陵区", "阆中市", "南部县", "南隆镇", "营山县", "朗池镇", "蓬安县", "周口镇", "仪陇县", "新政镇", "西充县", "晋城镇"}
                },
                {"0_22_5", new[] {"广安区", "华蓥市", "岳池县", "九龙镇", "武胜县", "沿口镇", "邻水县", "鼎屏镇"}},
                {"0_22_6", new[] {"船山区", "安居区", "蓬溪县", "赤城镇", "射洪县", "太和镇", "大英县", "蓬莱镇"}},
                {"0_22_7", new[] {"市中区", "东兴区", "威远县", "严陵镇", "资中县", "重龙镇", "隆昌县", "金鹅镇"}},
                {
                    "0_22_8", new[]
                    {
                        "市中区", "沙湾区", "五通桥区", "金口河区", "峨眉山市", "犍为县", "玉津镇", "井研县", "研城镇", "夹江县", "漹城镇", "沐川县", "沐溪镇",
                        "峨边彝族自治县",
                        "沙坪镇", "马边彝族自治县", "民建镇"
                    }
                },
                {"0_22_9", new[] {"自流井区", "大安区", "贡井区", "沿滩区", "荣县", "旭阳镇", "富顺县", "富世镇"}},
                {"0_22_10", new[] {"江阳区", "纳溪区", "龙马潭区", "泸县", "福集镇", "合江县", "合江镇", "叙永县", "叙永镇", "古蔺县", "古蔺镇"}},
                {
                    "0_22_11", new[]
                    {
                        "翠屏区", "宜宾县", "柏溪镇", "南溪县", "南溪镇", "江安县", "江安镇", "长宁县", "长宁镇", "高县", "庆符镇", "筠连县", "筠连镇", "珙县",
                        "巡场镇",
                        "兴文县", "中城镇", "屏山县", "屏山镇"
                    }
                },
                {"0_22_12", new[] {"东区", "西区", "仁和区", "米易县", "攀莲镇", "盐边县", "桐子林镇"}},
                {"0_22_13", new[] {"巴州区", "通江县", "诺江镇", "南江县", "南江镇", "平昌县", "江口镇"}},
                {"0_22_14", new[] {"通川区", "万源市", "达县", "南外镇", "宣汉县", "东乡镇", "开江县", "新宁镇", "大竹县", "竹阳镇", "渠县", "渠江镇"}},
                {"0_22_15", new[] {"雁江区", "简阳市", "乐至县", "天池镇", "安岳县", "岳阳镇"}},
                {"0_22_16", new[] {"东坡区", "仁寿县", "文林镇", "彭山县", "凤鸣镇", "洪雅县", "洪川镇", "丹棱县", "丹棱镇", "青神县", "城厢镇"}},
                {
                    "0_22_17", new[]
                    {
                        "雨城区", "名山县", "蒙阳镇", "荥经县", "严道镇", "汉源县", "富林镇", "石棉县", "新棉镇", "天全县", "城厢镇", "芦山县", "芦阳镇", "宝兴县",
                        "穆坪镇"
                    }
                },
                {
                    "0_22_18", new[]
                    {
                        "马尔康县", "马尔康镇", "汶川县", "威州镇", "理县", "杂谷脑镇", "茂县", "凤仪镇", "松潘县", "进安镇", "九寨沟县", "永乐镇", "金川县",
                        "金川镇",
                        "小金县", "美兴镇", "黑水县", "芦花镇", "壤塘县", "壤柯镇", "阿坝县", "阿坝镇", "若尔盖县", "达扎寺镇", "红原县", "邛溪镇"
                    }
                },
                {
                    "0_22_19", new[]
                    {
                        "康定县", "炉城镇", "泸定县", "泸桥镇", "丹巴县", "章谷镇", "九龙县", "呷尔镇", "雅江县", "河口镇", "道孚县", "鲜水镇", "炉霍县", "新都镇",
                        "甘孜县",
                        "甘孜镇", "新龙县", "茹龙镇", "德格县", "更庆镇", "白玉县", "建设镇", "石渠县", "尼呷镇", "色达县", "色柯镇", "理塘县", "高城镇", "巴塘县",
                        "夏邛镇", "乡城县", "桑披镇", "稻城县", "金珠镇", "得荣县", "松麦镇"
                    }
                },
                {
                    "0_22_20", new[]
                    {
                        "西昌市", "盐源县", "盐井镇", "德昌县", "德州镇", "会理县", "城关镇", "会东县", "会东镇", "宁南县", "披砂镇", "普格县", "普基镇", "布拖县",
                        "特木里镇", "金阳县", "天地坝镇", "昭觉县", "新城镇", "喜德县", "光明镇", "冕宁县", "城厢镇", "越西县", "越城镇", "甘洛县", "新市坝镇",
                        "美姑县",
                        "巴普镇", "雷波县", "锦城镇", "木里藏族自治县", "乔瓦镇"
                    }
                },
                {
                    "0_22", new[]
                    {
                        "成都市", "广元市", "绵阳市", "德阳市", "南充市", "广安市", "遂宁市", "内江市", "乐山市", "自贡市", "泸州市", "宜宾市", "攀枝花市",
                        "巴中市",
                        "达州市", "资阳市", "眉山市", "雅安市", "阿坝州", "甘孜州", "凉山州"
                    }
                },
                {
                    "0_23_0",
                    new[] {"乌当区", "南明区", "云岩区", "花溪区", "白云区", "小河区", "清镇市", "开阳县", "城关镇", "修文县", "龙场镇", "息烽县", "永靖镇"}
                },
                {"0_23_1", new[] {"钟山区", "盘县", "红果镇", "六枝特区", "平寨镇", "水城县"}},
                {
                    "0_23_2", new[]
                    {
                        "红花岗区", "汇川区", "赤水市", "仁怀市", "遵义县", "南白镇", "桐梓县", "娄山关镇", "绥阳县", "洋川镇", "正安县", "凤仪镇", "凤冈县",
                        "龙泉镇",
                        "湄潭县", "湄江镇", "余庆县", "白泥镇", "习水县", "东皇镇", "道真仡佬族苗族自治县", "玉溪镇", "务川仡佬族苗族自治县", "都濡镇"
                    }
                },
                {
                    "0_23_3",
                    new[]
                    {"西秀区", "平坝县", "城关镇", "普定县", "城关镇", "关岭布依族苗族自治县", "关索镇", "镇宁布依族苗族自治县", "城关镇", "紫云苗族布依族自治县", "松山镇"}
                },
                {
                    "0_23_4", new[]
                    {
                        "毕节市", "大方县", "大方镇", "黔西县", "城关镇", "金沙县", "城关镇", "织金县", "城关镇", "纳雍县", "雍熙镇", "赫章县", "城关镇",
                        "威宁彝族回族苗族自治县", "草海镇"
                    }
                },
                {
                    "0_23_5", new[]
                    {
                        "铜仁市", "江口县", "双江镇", "石阡县", "汤山镇", "思南县", "思唐镇", "德江县", "青龙镇", "玉屏侗族自治县", "平溪镇", "印江土家族苗族自治县",
                        "峨岭镇",
                        "沿河土家族自治县", "和平镇", "松桃苗族自治县", "蓼皋镇", "万山特区", "万山镇"
                    }
                },
                {
                    "0_23_6", new[]
                    {
                        "凯里市", "黄平县", "新州镇", "施秉县", "城关镇", "三穗县", "八弓镇", "镇远县", "阳镇", "岑巩县", "思旸镇", "天柱县", "凤城镇", "锦屏县",
                        "三江镇",
                        "剑河县", "革东镇", "台江县", "台拱镇", "黎平县", "德凤镇", "榕江县", "古州镇", "从江县", "丙妹镇", "雷山县", "丹江镇", "麻江县", "杏山镇",
                        "丹寨县", "龙泉镇"
                    }
                },
                {
                    "0_23_7", new[]
                    {
                        "都匀市", "福泉市", "荔波县", "玉屏镇", "贵定县", "城关镇", "瓮安县", "雍阳镇", "独山县", "城关镇", "平塘县", "平湖镇", "罗甸县", "龙坪镇",
                        "长顺县",
                        "长寨镇", "龙里县", "龙山镇", "惠水县", "和平镇", "三都水族自治县", "三合镇"
                    }
                },
                {
                    "0_23_8", new[]
                    {
                        "兴义市", "兴仁县", "城关镇", "普安县", "盘水镇", "晴隆县", "莲城镇", "贞丰县", "珉谷镇", "望谟县", "复兴镇", "册亨县", "者楼镇", "安龙县",
                        "新安镇",
                        "剑河县人民政府驻地由柳川镇迁至革东镇"
                    }
                },
                {"0_23", new[] {"贵阳市", "六盘水市", "遵义市", "安顺市", "毕节", "铜仁", "黔东南州", "黔南州", "黔西南州"}},
                {
                    "0_24_0", new[]
                    {
                        "盘龙区", "五华区", "官渡区", "西山区", "东川区", "安宁市", "呈贡县", "龙城镇", "晋宁县", "昆阳镇", "富民县", "永定镇", "宜良县", "匡远镇",
                        "嵩明县",
                        "嵩阳镇", "石林彝族自治县", "鹿阜镇", "禄劝彝族苗族自治县", "屏山镇", "寻甸回族彝族自治县", "仁德镇"
                    }
                },
                {
                    "0_24_1", new[]
                    {
                        "麒麟区", "宣威市", "马龙县", "通泉镇", "沾益县", "西平镇", "富源县", "中安镇", "罗平县", "罗雄镇", "师宗县", "丹凤镇", "陆良县", "中枢镇",
                        "会泽县",
                        "金钟镇"
                    }
                },
                {
                    "0_24_2", new[]
                    {
                        "红塔区", "江川县", "大街镇", "澄江县", "凤麓镇", "通海县", "秀山镇", "华宁县", "宁州镇", "易门县", "龙泉镇", "峨山彝族自治县", "双江镇",
                        "新平彝族傣族自治县", "桂山镇", "元江哈尼族彝族傣族自治县", "澧江镇"
                    }
                },
                {"0_24_3", new[] {"隆阳区", "施甸县", "甸阳镇", "腾冲县", "腾越镇", "龙陵县", "龙山镇", "昌宁县", "田园镇"}},
                {
                    "0_24_4", new[]
                    {
                        "昭阳区", "鲁甸县", "文屏镇", "巧家县", "新华镇", "盐津县", "盐井镇", "大关县", "翠华镇", "永善县", "溪落渡镇", "绥江县", "中城镇",
                        "镇雄县",
                        "乌峰镇", "彝良县", "角奎镇", "威信县", "扎西镇", "水富县", "向家坝镇"
                    }
                },
                {"0_24_5", new[] {"古城区", "永胜县", "永北镇", "华坪县", "中心镇", "玉龙纳西族自治县", "黄山镇", "宁蒗彝族自治县", "大兴镇"}},
                {
                    "0_24_6", new[]
                    {
                        "翠云区", "普洱哈尼族彝族自治县", "宁洱镇", "墨江哈尼族自治县", "联珠镇", "景东彝族自治县", "锦屏镇", "景谷傣族彝族自治县", "威远镇",
                        "镇沅彝族哈尼族拉祜族自治县",
                        "恩乐镇", "江城哈尼族彝族自治县", "勐烈镇", "孟连傣族拉祜族佤族自治县", "娜允镇", "澜沧拉祜族自治县", "勐朗镇", "西盟佤族自治县", "勐梭镇"
                    }
                },
                {
                    "0_24_7", new[]
                    {
                        "临翔区", "凤庆县", "凤山镇", "云县", "爱华镇", "永德县", "德党镇", "镇康县", "南伞镇", "双江拉祜族佤族布朗族傣族自治县", "勐勐镇",
                        "耿马傣族佤族自治县",
                        "耿马镇", "沧源佤族自治县", "勐董镇"
                    }
                },
                {"0_24_8", new[] {"潞西市", "瑞丽市", "梁河县", "遮岛镇", "盈江县", "平原镇", "陇川县", "章凤镇"}},
                {"0_24_9", new[] {"泸水县六库镇", "泸水县", "六库镇", "福贡县", "上帕镇", "贡山独龙族怒族自治县", "茨开镇", "兰坪白族普米族自治县", "金顶镇"}},
                {"0_24_10", new[] {"香格里拉县", "建塘镇", "德钦县", "升平镇", "维西傈僳族自治县", "保和镇"}},
                {
                    "0_24_11", new[]
                    {
                        "大理市", "祥云县", "祥城镇", "宾川县", "金牛镇", "弥渡县", "弥城镇", "永平县", "博南镇", "云龙县", "诺邓镇", "洱源县", "茈碧湖镇",
                        "剑川县",
                        "金华镇", "鹤庆县", "云鹤镇", "漾濞彝族自治县", "苍山西镇", "南涧彝族自治县", "南涧镇", "巍山彝族回族自治县", "南诏镇"
                    }
                },
                {
                    "0_24_12", new[]
                    {
                        "楚雄市", "双柏县", "妥甸镇", "牟定县", "共和镇", "南华县", "龙川镇", "姚安县", "栋川镇", "大姚县", "金碧镇", "永仁县", "永定镇", "元谋县",
                        "元马镇",
                        "武定县", "狮山镇", "禄丰县", "金山镇"
                    }
                },
                {
                    "0_24_13", new[]
                    {
                        "蒙自县", "文澜镇", "个旧市", "开远市", "绿春县", "大兴镇", "建水县", "临安镇", "石屏县", "异龙镇", "弥勒县", "弥阳镇", "泸西县", "中枢镇",
                        "元阳县",
                        "南沙镇", "红河县", "迤萨镇", "金平苗族瑶族傣族自治县", "金河镇", "河口瑶族自治县", "河口镇", "屏边苗族自治县", "玉屏镇"
                    }
                },
                {
                    "0_24_14", new[]
                    {
                        "文山县", "开化镇", "砚山县", "江那镇", "西畴县", "西洒镇", "麻栗坡县", "麻栗镇", "马关县", "马白镇", "丘北县", "锦屏镇", "广南县",
                        "莲城镇",
                        "富宁县", "新华镇"
                    }
                },
                {"0_24_15", new[] {"景洪市", "勐海县", "勐海镇", "勐腊县", "勐腊镇"}},
                {
                    "0_24", new[]
                    {
                        "昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "思茅市", "临沧市", "德宏州", "怒江州", "迪庆州", "大理州", "楚雄州", "红河州",
                        "文山州",
                        "西双版纳州"
                    }
                },
                {
                    "0_25_0", new[]
                    {
                        "城关区", "林周县", "甘丹曲果镇", "当雄县", "当曲卡镇", "尼木县", "塔荣镇", "曲水县", "曲水镇", "堆龙德庆县", "东嘎镇", "达孜县", "德庆镇",
                        "墨竹工卡县",
                        "工卡镇"
                    }
                },
                {
                    "0_25_1", new[]
                    {
                        "那曲县", "那曲镇", "嘉黎县", "阿扎镇", "比如县", "比如镇", "聂荣县", "聂荣镇", "安多县", "帕那镇", "申扎县", "申扎镇", "索县", "亚拉镇",
                        "班戈县",
                        "普保镇", "巴青县", "拉西镇", "尼玛县", "尼玛镇"
                    }
                },
                {
                    "0_25_2", new[]
                    {
                        "昌都县", "城关镇", "江达县", "江达镇", "贡觉县", "莫洛镇", "类乌齐县", "桑多镇", "丁青县", "丁青镇", "察雅县", "烟多镇", "八宿县",
                        "白玛镇",
                        "左贡县", "旺达镇", "芒康县", "嘎托镇", "洛隆县", "孜托镇", "边坝县", "草卡镇"
                    }
                },
                {
                    "0_25_3", new[]
                    {
                        "林芝县", "八一镇", "工布江达县", "工布江达镇", "米林县", "米林镇", "墨脱县", "墨脱镇", "波密县", "扎木镇", "察隅县", "竹瓦根镇", "朗县",
                        "朗镇"
                    }
                },
                {
                    "0_25_4", new[]
                    {
                        "乃东县", "泽当镇", "扎囊县", "扎塘镇", "贡嘎县", "吉雄镇", "桑日县", "桑日镇", "琼结县", "琼结镇", "曲松县", "曲松镇", "措美县", "措美镇",
                        "洛扎县",
                        "洛扎镇", "加查县", "安绕镇", "隆子县", "隆子镇", "错那县", "错那镇", "浪卡子县", "浪卡子镇"
                    }
                },
                {
                    "0_25_5", new[]
                    {
                        "日喀则市", "南木林县", "南木林镇", "江孜县", "江孜镇", "定日县", "协格尔镇", "萨迦县", "萨迦镇", "拉孜县", "曲下镇", "昂仁县", "卡嘎镇",
                        "谢通门县",
                        "卡嘎镇", "白朗县", "洛江镇", "仁布县", "德吉林镇", "康马县", "康马镇", "定结县", "江嘎镇", "仲巴县", "拉让乡", "亚东县", "下司马镇",
                        "吉隆县",
                        "宗嘎镇", "聂拉木县", "聂拉木镇", "萨嘎县", "加加镇", "岗巴县", "岗巴镇"
                    }
                },
                {
                    "0_25_6", new[]
                    {
                        "噶尔县", "狮泉河镇", "普兰县", "普兰镇", "札达县", "托林镇", "日土县", "日土镇", "革吉县", "革吉镇", "改则县", "改则镇", "措勤县",
                        "措勤镇",
                        "林芝县人民政府驻地由林芝镇迁至八一镇"
                    }
                },
                {"0_25", new[] {"拉萨市", "那曲", "昌都", "林芝", "山南", "日喀则", "阿里"}},
                {
                    "0_26_0", new[]
                    {
                        "莲湖区", "新城区", "碑林区", "灞桥区", "未央区", "雁塔区", "阎良区", "临潼区", "长安区", "蓝田县", "蓝关镇", "周至县", "二曲镇", "户县",
                        "甘亭镇",
                        "高陵县", "鹿苑镇"
                    }
                },
                {
                    "0_26_1", new[]
                    {
                        "宝塔区", "延长县", "七里村镇", "延川县", "延川镇", "子长县", "瓦窑堡镇", "安塞县", "真武洞镇", "志丹县", "保安镇", "吴起县", "吴旗镇",
                        "甘泉县",
                        "城关镇", "富县", "富城镇", "洛川县", "凤栖镇", "宜川县", "丹州镇", "黄龙县", "石堡镇", "黄陵县", "桥山镇"
                    }
                },
                {"0_26_2", new[] {"耀州区", "王益区", "印台区", "宜君县", "城关镇"}},
                {
                    "0_26_3", new[]
                    {
                        "临渭区", "华阴市", "韩城市", "华县", "华州镇", "潼关县", "城关镇", "大荔县", "城关镇", "蒲城县", "城关镇", "澄城县", "城关镇", "白水县",
                        "城关镇",
                        "合阳县", "城关镇", "富平县", "窦村镇"
                    }
                },
                {
                    "0_26_4", new[]
                    {
                        "秦都区", "杨陵区", "渭城区", "兴平市", "三原县", "城关镇", "泾阳县", "泾干镇", "乾县", "城关镇", "礼泉县", "城关镇", "永寿县", "监军镇",
                        "彬县",
                        "城关镇", "长武县", "昭仁镇", "旬邑县", "城关镇", "淳化县", "城关镇", "武功县", "普集镇"
                    }
                },
                {
                    "0_26_5", new[]
                    {
                        "渭滨区", "金台区", "陈仓区", "凤翔县", "城关镇", "岐山县", "凤鸣镇", "扶风县", "城关镇", "眉县", "首善镇", "陇县", "城关镇", "千阳县",
                        "城关镇",
                        "麟游县", "九成宫镇", "凤县", "双石铺镇", "太白县", "嘴头镇"
                    }
                },
                {
                    "0_26_6", new[]
                    {
                        "汉台区", "南郑县", "城关镇", "城固县", "博望镇", "洋县", "洋州镇", "西乡县", "城关镇", "勉县", "勉阳镇", "宁强县", "汉源镇", "略阳县",
                        "城关镇",
                        "镇巴县", "泾洋镇", "留坝县", "城关镇", "佛坪县", "袁家庄镇"
                    }
                },
                {
                    "0_26_7", new[]
                    {
                        "榆阳区", "神木县", "神木镇", "府谷县", "府谷镇", "横山县", "横山镇", "靖边县", "张家畔镇", "定边县", "定边镇", "绥德县", "名州镇",
                        "米脂县",
                        "银州镇", "佳县", "佳芦镇", "吴堡县", "宋家川镇", "清涧县", "宽洲镇", "子洲县", "双湖峪镇"
                    }
                },
                {
                    "0_26_8", new[]
                    {
                        "汉滨区", "汉阴县", "城关镇", "石泉县", "城关镇", "宁陕县", "城关镇", "紫阳县", "城关镇", "岚皋县", "城关镇", "平利县", "城关镇", "镇坪县",
                        "城关镇",
                        "旬阳县", "城关镇", "白河县", "城关镇"
                    }
                },
                {
                    "0_26_9",
                    new[] {"商州区", "洛南县", "城关镇", "丹凤县", "龙驹寨镇", "商南县", "城关镇", "山阳县", "城关镇", "镇安县", "永乐镇", "柞水县", "乾佑镇"}
                },
                {"0_26", new[] {"西安市", "延安市", "铜川市", "渭南市", "咸阳市", "宝鸡市", "汉中市", "榆林市", "安康市", "商洛市"}},
                {"0_27_0", new[] {"城关区", "七里河区", "西固区", "安宁区", "红古区", "永登县", "城关镇", "皋兰县", "石洞镇", "榆中县", "城关镇"}},
                {"0_27_1", new[] {"金昌市", "金川区", "永昌县", "城关镇"}},
                {"0_27_2", new[] {"白银区", "平川区", "靖远县", "乌兰镇", "会宁县", "会师镇", "景泰县", "一条山镇"}},
                {
                    "0_27_3",
                    new[] {"秦州区", "麦积区", "清水县", "永清镇", "秦安县", "兴国镇", "甘谷县", "大像山镇", "武山县", "城关镇", "张家川回族自治县", "张家川镇"}
                },
                {"0_27_4", new[] {"凉州区", "民勤县", "城关镇", "古浪县", "古浪镇", "天祝藏族自治县", "华藏寺镇"}},
                {
                    "0_27_5",
                    new[] {"肃州区", "玉门市", "敦煌市", "金塔县", "金塔镇", "安西县", "渊泉镇", "肃北蒙古族自治县", "党城湾镇", "阿克塞哈萨克族自治县", "红柳湾镇"}
                },
                {"0_27_6", new[] {"甘州区", "民乐县", "洪水镇", "临泽县", "沙河镇", "高台县", "城关镇", "山丹县", "清泉镇", "肃南裕固族自治县", "红湾寺镇"}},
                {
                    "0_27_7", new[]
                    {
                        "西峰区", "庆城县", "庆城镇", "环县", "环城镇", "华池县", "柔远镇", "合水县", "西华池镇", "正宁县", "山河镇", "宁县", "新宁镇", "镇原县",
                        "城关镇"
                    }
                },
                {
                    "0_27_8",
                    new[] {"崆峒区", "泾川县", "城关镇", "灵台县", "中台镇", "崇信县", "锦屏镇", "华亭县", "东华镇", "庄浪县", "水洛镇", "静宁县", "城关镇"}
                },
                {
                    "0_27_9",
                    new[] {"安定区", "通渭县", "平襄镇", "临洮县", "洮阳镇", "漳县", "武阳镇", "岷县", "岷阳镇", "渭源县", "清源镇", "陇西县", "巩昌镇"}
                },
                {
                    "0_27_10", new[]
                    {
                        "武都区", "成县", "城关镇", "宕昌县", "城关镇", "康县", "文县", "城关镇", "西和县", "汉源镇", "礼县", "城关镇", "两当县", "城关镇",
                        "徽县",
                        "城关镇"
                    }
                },
                {
                    "0_27_11", new[]
                    {
                        "临夏市", "临夏县", "韩集镇", "康乐县", "附城镇", "永靖县", "刘家峡镇", "广河县", "城关镇", "和政县", "城关镇", "东乡族自治县", "锁南坝镇",
                        "积石山保安族东乡族撒拉族自治县", "吹麻滩镇"
                    }
                },
                {
                    "0_27_12", new[]
                    {
                        "合作市", "临潭县", "城关镇", "卓尼县", "柳林镇", "舟曲县", "城关镇", "迭部县", "电尕镇", "玛曲县", "尼玛镇", "碌曲县", "玛艾镇", "夏河县",
                        "拉卜楞镇"
                    }
                },
                {
                    "0_27",
                    new[] {"兰州市", "嘉峪关市", "白银市", "天水市", "武威市", "酒泉市", "张掖市", "庆阳市", "平凉市", "定西市", "陇南市", "临夏州", "甘南州"}
                },
                {"0_28_0", new[] {"城中区", "城东区", "城西区", "城北区", "大通回族土族自治县", "桥头镇", "湟源县", "城关镇", "湟中县", "鲁沙尔镇"}},
                {
                    "0_28_1", new[]
                    {
                        "平安县", "平安镇", "乐都县", "碾伯镇", "民和回族土族自治县", "川口镇", "互助土族自治县", "威远镇", "化隆回族自治县", "巴燕镇", "循化撒拉族自治县",
                        "积石镇"
                    }
                },
                {"0_28_2", new[] {"海晏县", "三角城镇", "祁连县", "八宝镇", "刚察县", "沙柳河镇", "门源回族自治县", "浩门镇"}},
                {"0_28_3", new[] {"共和县", "恰卜恰镇", "同德县", "尕巴松多镇", "贵德县", "河阴镇", "兴海县", "子科滩镇", "贵南县", "茫曲镇"}},
                {"0_28_4", new[] {"同仁县", "隆务镇", "尖扎县", "马克唐镇", "泽库县", "泽曲镇", "河南蒙古族自治县", "优干宁镇"}},
                {
                    "0_28_5",
                    new[] {"玛沁县", "大武镇", "班玛县", "赛来塘镇", "甘德县", "柯曲镇", "达日县", "吉迈镇", "久治县", "智青松多镇", "玛多县", "黄河乡"}
                },
                {
                    "0_28_6",
                    new[] {"玉树县", "结古镇", "杂多县", "萨呼腾镇", "称多县", "称文镇", "治多县", "加吉博洛镇", "囊谦县", "香达镇", "曲麻莱县", "约改镇"}
                },
                {"0_28_7", new[] {"德令哈市", "格尔木市", "乌兰县", "希里沟镇", "都兰县", "察汗乌苏镇", "天峻县", "新源镇"}},
                {"0_28", new[] {"西宁市", "海东", "海北州", "海南州", "黄南州", "果洛州", "玉树州", "海西州"}},
                {"0_29_0", new[] {"兴庆区", "金凤区", "西夏区", "灵武市", "永宁县", "杨和镇", "贺兰县", "习岗镇"}},
                {"0_29_1", new[] {"大武口区", "惠农区", "平罗县", "城关镇"}},
                {"0_29_2", new[] {"利通区", "青铜峡市", "盐池县", "花马池镇", "同心县", "豫海镇"}},
                {"0_29_3", new[] {"原州区", "西吉县", "吉强镇", "隆德县", "城关镇", "泾源县", "香水镇", "彭阳县", "白阳镇"}},
                {"0_29_4", new[] {"沙坡头区", "中宁县", "海原县"}},
                {"0_29", new[] {"银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"}},
                {"0_30_0", new[] {"天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "达坂城区", "东山区", "乌鲁木齐县", "乌鲁木齐市水磨沟区"}},
                {"0_30_1", new[] {"克拉玛依区", "独山子区", "白碱滩区", "乌尔禾区"}},
                {"0_30_2", new[] {"石河子市", "阿拉尔市", "图木舒克市", "五家渠市"}},
                {
                    "0_30_3", new[]
                    {
                        "喀什市", "疏附县", "托克扎克镇", "疏勒县", "疏勒镇", "英吉沙县", "英吉沙镇", "泽普县", "泽普镇", "莎车县", "莎车镇", "叶城县", "喀格勒克镇",
                        "麦盖提县",
                        "麦盖提镇", "岳普湖县", "岳普湖镇", "伽师县", "巴仁镇", "巴楚县", "巴楚镇", "塔什库尔干塔吉克自治县", "塔什库尔干镇"
                    }
                },
                {
                    "0_30_4", new[]
                    {
                        "阿克苏市", "温宿县", "温宿镇", "库车县", "库车镇", "沙雅县", "沙雅镇", "新和县", "新和镇", "拜城县", "拜城镇", "乌什县", "乌什镇",
                        "阿瓦提县",
                        "阿瓦提镇", "柯坪县", "柯坪镇"
                    }
                },
                {
                    "0_30_5", new[]
                    {
                        "和田市", "和田县", "墨玉县", "喀拉喀什镇", "皮山县", "固玛镇", "洛浦县", "洛浦镇", "策勒县", "策勒镇", "于田县", "木尕拉镇", "民丰县",
                        "尼雅镇"
                    }
                },
                {"0_30_6", new[] {"吐鲁番市", "鄯善县", "鄯善镇", "托克逊县", "托克逊镇"}},
                {"0_30_7", new[] {"哈密市", "伊吾县", "伊吾镇", "巴里坤哈萨克自治县", "巴里坤镇"}},
                {"0_30_8", new[] {"阿图什市", "阿克陶县", "阿克陶镇", "阿合奇县", "阿合奇镇", "乌恰县", "乌恰镇"}},
                {"0_30_9", new[] {"博乐市", "精河县", "精河镇", "温泉县", "博格达尔镇"}},
                {
                    "0_30_10", new[]
                    {
                        "昌吉市", "阜康市", "米泉市", "呼图壁县", "呼图壁镇", "玛纳斯县", "玛纳斯镇", "奇台县", "奇台镇", "吉木萨尔县", "吉木萨尔镇", "木垒哈萨克自治县",
                        "木垒镇"
                    }
                },
                {
                    "0_30_11", new[]
                    {
                        "库尔勒市", "轮台县", "轮台镇", "尉犁县", "尉犁镇", "若羌县", "若羌镇", "且末县", "且末镇", "和静县", "和静镇", "和硕县", "特吾里克镇",
                        "博湖县",
                        "博湖镇", "焉耆回族自治县", "焉耆镇"
                    }
                },
                {
                    "0_30_12", new[]
                    {
                        "伊宁市", "奎屯市", "伊宁县", "吉里于孜镇", "霍城县", "水定镇", "巩留县", "巩留镇", "新源县", "新源镇", "昭苏县", "昭苏镇", "特克斯县",
                        "特克斯镇",
                        "尼勒克县", "尼勒克镇", "察布查尔锡伯自治县", "察布查尔镇"
                    }
                },
                {
                    "0_30_13",
                    new[]
                    {"塔城市", "乌苏市", "额敏县", "额敏镇", "沙湾县", "三道河子镇", "托里县", "托里镇", "裕民县", "哈拉布拉镇", "和布克赛尔蒙古自治县", "和布克赛尔镇"}
                },
                {"0_30_14", new[] {"阿勒泰市", "布尔津县", "布尔津镇", "富蕴县", "库额尔齐斯镇", "福海县", "哈巴河县", "青河县", "吉木乃县"}},
                {
                    "0_30", new[]
                    {
                        "乌鲁木齐市", "克拉玛依市", "喀什", "阿克苏", "和田", "吐鲁番", "哈密", "克孜勒苏柯州", "博尔塔拉州", "昌吉州", "巴音郭楞州", "伊犁州", "塔城",
                        "阿勒泰"
                    }
                },
                {
                    "0_31_0", new[]
                    {
                        "中西区", "东区", "九龙城区", "观塘区", "南区", "深水埗区", "湾仔区", "黄大仙区", "油尖旺区", "离岛区", "葵青区", "北区", "西贡区",
                        "沙田区",
                        "屯门区", "大埔区", "荃湾区", "元朗区"
                    }
                },
                {"0_31", new[] {"香港特别行政区"}},
                {"0_32_0", new[] {"澳门特别行政区"}},
                {"0_32", new[] {"澳门特别行政区"}},
                {"0_33_0", new[] {" "}},
                {
                    "0_33", new[]
                    {
                        "台北", "高雄", "台中", "花莲", "基隆", "嘉义", "金门", "连江", "苗栗", "南投", "澎湖", "屏东", "台东", "台南", "桃园", "新竹",
                        "宜兰",
                        "云林", "彰化"
                    }
                }
            };
        }


        /// <summary>
        ///     获取随机省份
        /// </summary>
        /// <returns></returns>
        public static string GetRandProvince()
        {
            if (_dic == null)
            {
                Init1();
            }

            return _dic["0"][R.Next(0, _dic["0"].Length)];
        }

        /// <summary>
        ///     获取随机城市(地级)
        /// </summary>
        /// <returns></returns>
        public static string GetRandCity1()
        {
            if (_dic == null)
            {
                Init1();
            }
            var keys = new List<string>();
            keys.AddRange(_dic.Keys);
            var result = new List<string>();
            for (var i = 0; i < keys.Count; i++)
            {
                if (keys[i].Split('_').Length == 2)
                {
                    result.Add(keys[i]);
                }
            }
            var rkey = result[R.Next(0, result.Count)];
            return _dic[rkey][R.Next(0, _dic[rkey].Length)];
        }

        /// <summary>
        ///     获取随机城市(县级)
        /// </summary>
        /// <returns></returns>
        public static string GetRandCity2()
        {
            if (_dic == null)
            {
                Init1();
            }
            var keys = new List<string>();
            keys.AddRange(_dic.Keys);
            var result = new List<string>();
            for (var i = 0; i < keys.Count; i++)
            {
                if (keys[i].Split('_').Length == 3)
                {
                    result.Add(keys[i]);
                }
            }
            var rkey = result[R.Next(0, result.Count)];
            return _dic[rkey][R.Next(0, _dic[rkey].Length)];
        }

        /// <summary>
        ///     获取包含省份的城市名
        /// </summary>
        /// <param name="isCity2">是否获取到县级，否则只获取到省级</param>
        /// <returns></returns>
        public static string GetProvinceAndCity(bool isCity2)
        {
            if (_dic == null)
            {
                Init1();
            }
            var keys = new List<string>();
            keys.AddRange(_dic.Keys);
            var result = new List<string>();
            for (var i = 0; i < keys.Count; i++)
            {
                if (keys[i].Split('_').Length == 2)
                {
                    result.Add(keys[i]);
                }
            }
            var rkey = result[R.Next(0, result.Count)];
            if (!isCity2)
            {
                var shengfen = _dic["0"][Convert.ToInt32(rkey.Split('_')[1])];
                var diji = _dic[rkey][R.Next(0, _dic[rkey].Length)];
                return (shengfen != diji ? shengfen + diji : shengfen);
            }
            else
            {
                var result2 = new List<string>();
                for (var i = 0; i < keys.Count; i++)
                {
                    if (keys[i].Contains(rkey) && keys[i].Split('_').Length == 3)
                    {
                        result2.Add(keys[i]);
                    }
                }
                var rkey2 = result2[R.Next(0, result2.Count)];
                var shengfen = _dic["0"][Convert.ToInt32(rkey.Split('_')[1])];
                var diji = _dic[rkey][R.Next(0, _dic[rkey].Length)];
                return (shengfen != diji ? shengfen + diji : shengfen) + _dic[rkey2][R.Next(0, _dic[rkey2].Length)];
            }
        }

        #endregion

        #region 名字生成

        private static string[] _xing;
        private static string[] _ming;
        private static string[] _gongsi;

        private static void Init2()
        {
            _xing = new[]
            {
                "李", "王", "张", "刘", "陈", "杨", "赵", "黄", "周", "吴", "徐", "孙", "胡", "朱", "李", "王", "张", "刘", "陈", "杨", "赵",
                "黄", "周", "吴", "徐", "孙", "胡", "朱", "李", "王", "张", "刘", "陈", "杨", "赵", "黄", "周", "吴", "徐", "孙", "胡", "朱",
                "李", "王", "张", "刘", "陈", "杨", "赵", "黄", "周", "吴", "徐", "孙", "胡", "朱", "李", "王", "张", "刘", "陈", "杨", "赵",
                "黄", "周", "吴", "徐", "孙", "胡", "朱", "高", "林", "何", "郭", "马", "罗", "梁", "宋", "郑", "谢", "韩", "唐", "冯", "于",
                "董", "萧", "程", "曹", "袁", "邓", "许", "傅", "沈", "曾", "彭", "吕", "苏", "卢", "蒋", "蔡", "贾", "丁", "魏", "薛", "叶",
                "阎", "余", "潘", "杜", "戴", "夏", "钟", "汪", "田", "任", "姜", "范", "方", "石", "姚", "谭", "廖", "邹", "熊", "金", "陆",
                "郝", "孔", "白", "崔", "康", "毛", "邱", "秦", "江", "史", "顾", "侯", "邵", "孟", "龙", "万", "段", "雷", "钱", "汤", "尹",
                "黎", "易", "常", "武", "乔", "贺", "赖", "龚", "文"
            };
            _ming = new[]
            {
                "起", "名", "常", "用", "字", "库", "一", "画", "指", "繁", "体", "笔", "以", "下", "同", "乙", "二", "乃", "了", "力", "丁",
                "刀", "刁", "又", "人", "入", "七", "十", "几", "三", "口", "干", "工", "弓", "久", "己", "土", "大", "丈", "女", "巾", "勺",
                "丸", "也", "于", "弋", "巳", "兀", "上", "乞", "士", "夕", "千", "子", "寸", "小", "山", "川", "才", "凡", "四", "公", "孔",
                "亢", "勾", "中", "之", "丹", "井", "介", "今", "内", "及", "太", "天", "屯", "斗", "斤", "牛", "丑", "支", "允", "元", "勿",
                "午", "友", "尤", "尹", "引", "文", "月", "日", "牙", "王", "云", "匀", "仁", "什", "切", "升", "收", "壬", "少", "心", "手",
                "氏", "水", "仍", "双", "尺", "仇", "止", "不", "互", "分", "匹", "化", "卡", "卞", "肥", "反", "夫", "巴", "幻", "户", "方",
                "木", "比", "毛", "仆", "丰", "火", "片", "五", "古", "可", "瓜", "甘", "刊", "丘", "加", "去", "句", "叫", "外", "巧", "巨",
                "玉", "甲", "令", "占", "主", "冬", "他", "代", "只", "仗", "另", "召", "尼", "正", "田", "旦", "奴", "凸", "立", "叮", "仝",
                "伏", "台", "奶", "凹", "央", "右", "未", "永", "戊", "瓦", "由", "幼", "仕", "仙", "兄", "司", "且", "史", "左", "世", "出",
                "市", "玄", "仔", "冉", "穴", "示", "生", "申", "充", "仞", "仟", "册", "求", "石", "匝", "甩", "丙", "平", "母", "弘", "末",
                "包", "本", "弗", "北", "必", "丕", "半", "布", "皿", "目", "乏", "禾", "皮", "疋", "矛", "乎", "付", "卉", "民", "冰", "白",
                "卯", "六", "伉", "光", "匡", "共", "各", "考", "交", "件", "价", "企", "伍", "伎", "仰", "吉", "圭", "曲", "机", "艮", "仲",
                "州", "朱", "兆", "决", "匠", "地", "旨", "朵", "吏", "列", "年", "劣", "打", "汀", "至", "臼", "灯", "竹", "老", "舟", "吊",
                "圳", "的", "宅", "肉", "虫", "伊", "印", "因", "宇", "安", "屹", "有", "羊", "而", "耳", "衣", "亦", "吃", "夷", "奸", "聿",
                "丞", "休", "任", "先", "全", "再", "冲", "刑", "向", "在", "夙", "如", "守", "存", "寺", "式", "戌", "早", "旭", "旬", "次",
                "此", "系", "臣", "自", "舌", "血", "行", "西", "尖", "色", "后", "回", "好", "妃", "帆", "灰", "牟", "百", "份", "米", "伐",
                "亥", "合", "朴", "汜", "复", "克", "告", "改", "攻", "更", "杆", "谷", "况", "伽", "估", "君", "吴", "吸", "吾", "圻", "均",
                "坎", "研", "完", "局", "岐", "我", "扣", "杞", "江", "究", "见", "角", "言", "住", "低", "佃", "里", "冷", "伶", "利", "助",
                "努", "吝", "昌", "壮", "妓", "妞", "弄", "廷", "弟", "彤", "志", "托", "杖", "杜", "呆", "李", "男", "良", "具", "皂", "佟",
                "你", "足", "甸", "町", "豆", "吞", "玎", "位", "佐", "佘", "冶", "吟", "吻", "尾", "巫", "役", "忘", "修", "邑", "酉", "伸",
                "作", "些", "初", "吹", "呈", "坐", "孝", "宋", "希", "岑", "床", "序", "巡", "形", "忍", "成", "杏", "材", "杉", "束", "村",
                "步", "汝", "汐", "池", "私", "秀", "赤", "身", "车", "辰", "伺", "余", "劭", "劬", "邵", "妆", "汕", "灶", "即", "却", "何",
                "伯", "伴", "佛", "兵", "判", "别", "含", "坊", "坂", "吵", "宏", "旱", "每", "甫", "牡", "免", "孚", "庇", "忙", "汛", "贝",
                "儿", "八", "供", "侃", "刻", "卦", "固", "坤", "姑", "官", "冈", "庚", "快", "抗", "昆", "果", "空", "亟", "其", "券", "卷",
                "奇", "委", "季", "宜", "居", "届", "岢", "岸", "杰", "佳", "京", "侄", "来", "例", "制", "到", "兔", "两", "典", "周", "呢",
                "坦", "奈", "妮", "宙", "定", "屉", "帖", "底", "店", "征", "忝", "忠", "念", "技", "投", "政", "枝", "东", "林", "汰", "玖",
                "知", "直", "纠", "金", "乳", "侏", "佰", "侗", "佻", "佬", "冽", "卓", "拈", "妲", "妯", "宕", "岱", "岭", "帙", "抒", "杼",
                "沓", "炉", "竺", "长", "依", "侑", "味", "夜", "宛", "岳", "岩", "往", "亚", "武", "於", "易", "昂", "旺", "沅", "沃", "汪",
                "物", "艾", "卧", "佯", "咏", "抑", "昀", "炎", "杳", "事", "享", "侍", "使", "侈", "然", "刹", "刺", "协", "卒", "洽", "沁",
                "取", "受", "垂", "始", "炊", "姓", "妻", "妾", "尚", "屈", "弦", "所", "承", "昔", "松", "欣", "沙", "沈", "社", "舍", "采",
                "青", "幸", "徇", "争", "刷", "效", "姐", "姒", "姗", "炙", "宗", "岫", "析", "枕", "状", "并", "佩", "函", "和", "命", "坡",
                "坪", "奉", "孟", "帛", "府", "彼", "忽", "或", "戽", "房", "扮", "枇", "扶", "放", "昏", "朋", "服", "明", "杭", "杯", "枚",
                "板", "沛", "沐", "汾", "版", "牧", "虎", "门", "阜", "杷", "盲", "非", "九", "冠", "奎", "皈", "客", "故", "柑", "柯", "看",
                "科", "肝", "革", "屋", "癸", "砍", "禹", "轨", "页", "亭", "亮", "柱", "俊", "侣", "冒", "段", "劲", "南", "姬", "姜", "姣",
                "宦", "帝", "度", "痔", "建", "峙", "待", "律", "怠", "急", "招", "拒", "拓", "拙", "拉", "昭", "架", "柳", "注", "治", "炭",
                "界", "皆", "突", "纪", "纣", "耐", "肚", "致", "计", "订", "军", "酊", "俐", "胃", "厘", "咨", "姝", "姿", "柁", "沱", "重",
                "珏", "盅", "眈", "俄", "俞", "勇", "威", "娃", "姻", "姚", "姨", "幽", "彦", "奕", "哀", "哇", "玟", "怡", "押", "映", "昱",
                "韦", "油", "泳", "沿", "畏", "烟", "盈", "约", "耶", "衍", "要", "音", "柚", "胤", "信", "侠", "俗", "促", "俏", "前", "则",
                "奏", "型", "姹", "妊", "室", "宣", "巷", "咱", "哉", "思", "性", "施", "昨", "是", "春", "星", "查", "柴", "栅", "柔", "染",
                "泉", "帅", "甚", "相", "省", "砂", "祈", "秋", "穿", "肖", "首", "食", "香", "侵", "俟", "炷", "祉", "贞", "泓", "侯", "保",
                "便", "勉", "匍", "奔", "品", "封", "哈", "皇", "拔", "抱", "怕", "柏", "柄", "泌", "法", "泡", "炳", "玫", "盆", "眉", "红",
                "美", "虹", "秒", "表", "负", "面", "风", "飞", "眄", "勃", "厚", "咸", "叛", "孩", "奂", "屏", "枰", "某", "河", "泛", "赴",
                "恭", "拱", "格", "桂", "根", "耕", "耿", "股", "肯", "贡", "高", "个", "刚", "哥", "宫", "径", "挂", "皋", "徒", "倜", "恬",
                "拯", "拿", "料", "旅", "晋", "朕", "桌", "桔", "桃", "桐", "洞", "流", "洛", "酒", "烈", "特", "玲", "珍", "真", "矩", "祝",
                "秩", "租", "站", "级", "纸", "纳", "纽", "者", "肩", "芝", "记", "讨", "酌", "针", "钉", "挑", "借", "倒", "值", "俱", "倪",
                "倘", "伦", "兼", "唐", "哲", "娘", "旃", "娟", "娜", "展", "峻", "准", "凌", "洲", "套", "爹", "留", "俩", "庭", "恫", "耻",
                "烙", "栗", "株", "津", "玳", "畜", "砧", "恩", "按", "案", "鸟", "洋", "秧", "翁", "纹", "耘", "育", "芽", "芸", "蚊", "袁",
                "倚", "原", "员", "埃", "宴", "峨", "娱", "容", "峪", "晏", "移", "益", "差", "师", "席", "座", "徐", "恰", "息", "恕", "持",
                "拳", "拾", "时", "书", "曹", "校", "朔", "桑", "栽", "殊", "气", "珊", "祠", "神", "祖", "秦", "秤", "索", "素", "纱", "纾",
                "纯", "虔", "讫", "训", "财", "轩", "芩", "闪", "迅", "倩", "仓", "城", "夏", "孙", "宰", "射", "峡", "厝", "叟", "奚", "乘",
                "淞", "宵", "拭", "牲", "洵", "洳", "狩", "兹", "炸", "宸", "挈", "旁", "晃", "桓", "活", "洪", "畔", "亩", "眠", "破", "炮",
                "秘", "粉", "纺", "肺", "航", "般", "芳", "芙", "花", "配", "马", "倍", "俯", "俸", "们", "圃", "埋", "娩", "峰", "肪", "涵",
                "埔", "害", "恢", "恍", "恒", "派", "洹", "玻", "珉", "祜", "呗", "国", "寇", "康", "苦", "袍", "规", "贯", "够", "勘", "崞",
                "岗", "梗", "珙", "偕", "假", "健", "停", "侦", "剪", "动", "翎", "基", "坚", "堂", "堆", "婧", "寄", "专", "张", "得", "教",
                "救", "朗", "条", "梁", "梯", "械", "梨", "浙", "浪", "珠", "略", "皎", "眷", "窕", "竟", "第", "终", "累", "舵", "苓", "诀",
                "近", "钓", "顶", "将", "那", "庶", "振", "挺", "捉", "捐", "甜", "祭", "趾", "囵", "崃", "带", "帐", "徕", "悌", "梃", "桶",
                "娄", "伟", "偶", "务", "唯", "问", "婉", "寅", "尉", "帷", "庸", "悟", "悠", "悦", "敖", "晚", "梧", "浴", "眼", "苑", "英",
                "迎", "野", "鱼", "欲", "浣", "翌", "圉", "乾", "做", "区", "卿", "参", "售", "启", "商", "唱", "娶", "妇", "宿", "崇", "崎",
                "崔", "强", "从", "悄", "叙", "旋", "晨", "晟", "族", "消", "爽", "犀", "祥", "绅", "细", "紫", "组", "绍", "羞", "习", "邢",
                "舷", "船", "茄", "若", "处", "术", "袖", "设", "讼", "责", "赦", "雀", "雪", "顷", "彩", "孰", "匙", "圊", "执", "就", "峥",
                "崧", "巢", "悉", "笙", "钏", "阡", "凰", "毫", "培", "婚", "婆", "密", "彬", "彪", "患", "斌", "曼", "海", "浩", "烽", "班",
                "瓶", "毕", "盒", "符", "邦", "胡", "背", "胞", "胖", "舶", "范", "茅", "苗", "被", "觅", "访", "货", "返", "贩", "闭", "麦",
                "麻", "壶", "票", "冕", "副", "埠", "捕", "敏", "皓", "梅", "珩", "艴", "苹", "敢", "款", "淦", "筐", "给", "贵", "辜", "开",
                "凯", "诒", "询", "蛟", "植", "堵", "堤", "奠", "岚", "帧", "掌", "掘", "捷", "掏", "掎", "推", "探", "接", "敦", "景", "智",
                "晶", "替", "朝", "椒", "棠", "栈", "殖", "淘", "添", "淡", "净", "焦", "街", "诊", "理", "荔", "眨", "贴", "屠", "贷", "轸",
                "迢", "迪", "迦", "量", "钧", "钮", "间", "集", "劳", "单", "婷", "喋", "传", "塘", "塔", "暖", "楠", "殿", "渡", "汤", "帏",
                "幄", "惟", "掩", "椅", "涯", "液", "渊", "焰", "为", "异", "砚", "围", "茵", "越", "阮", "轶", "雁", "雅", "寓", "雯", "媛",
                "喻", "贻", "婺", "焱", "琬", "琰", "畲", "博", "堡", "报", "富", "寒", "嵋", "帽", "幅", "帮", "弼", "彭", "徨", "偏", "整",
                "惠", "扉", "排", "斑", "酣", "普", "棉", "棒", "棚", "混", "淼", "淮", "淝", "牌", "番", "发", "脉", "茗", "评", "贺", "费",
                "买", "贸", "迫", "邯", "闵", "防", "阪", "黄", "傅", "傍", "媒", "媚", "黑", "瓿", "匮", "块", "感", "揆", "楷", "港", "琨",
                "莞", "夸", "鼓", "该", "贾", "仅", "涂", "廊", "谦", "提", "敬", "斟", "极", "绢", "经", "茎", "莒", "获", "莅", "庄", "莉",
                "蜀", "装", "解", "詹", "鼎", "路", "迹", "退", "铃", "钜", "陀", "电", "雷", "靖", "顿", "桢", "嫁", "农", "贮", "钠", "湍",
                "琳", "当", "励", "园", "圆", "奥", "爱", "意", "扬", "援", "握", "榆", "业", "杨", "椰", "涌", "渝", "渭", "游", "炜", "爷",
                "兽", "犹", "煜", "碗", "筠", "义", "肄", "莠", "虞", "蛾", "裕", "诣", "郁", "钰", "雍", "阿", "预", "饮", "衙", "莹", "蓊",
                "晕", "渥", "畹", "筵", "裔", "催", "勤", "势", "嗣", "塞", "嵩", "厦", "新", "喧", "楸", "楚", "岁", "湘", "测", "凑", "煦",
                "琴", "琪", "琦", "睡", "祺", "稔", "稠", "筮", "粲", "绣", "群", "圣", "莎", "裙", "诩", "诗", "试", "诠", "详", "资", "载",
                "送", "铅", "阻", "雌", "颂", "驰", "熙", "暄", "琼", "想", "椿", "渚", "煮", "琛", "裟", "输", "轼", "幕", "汇", "惶", "挥",
                "描", "换", "楣", "枫", "湖", "浑", "渺", "涣", "煤", "烦", "琶", "琥", "盟", "睦", "碑", "禀", "聘", "腑", "荷", "莫", "号",
                "蜂", "补", "话", "酩", "附", "颁", "饭", "募", "焕", "廓", "愧", "沟", "管", "纲", "诰", "闺", "魁", "构", "歌", "恺", "斡",
                "荣", "嘏", "通", "连", "这", "甄", "兢", "喜", "团", "图", "奖", "嫡", "对", "僚", "侥", "屡", "嶂", "崭", "彰", "廖", "熊",
                "溜", "监", "祯", "种", "端", "箕", "筝", "精", "绿", "紧", "绫", "纶", "置", "璋", "畅", "榔", "糍", "滇", "尔", "莱", "赵",
                "铬", "领", "瑙", "奁", "闻", "嫣", "愿", "温", "源", "溢", "瑜", "瑛", "瑗", "玮", "与", "舞", "诱", "语", "郢", "银", "摇",
                "榕", "荥", "溶", "菸", "菀", "鞅", "僖", "逑", "速", "逍", "肾", "寿", "塾", "尘", "嫩", "实", "像", "侨", "岖", "慈", "滋",
                "沧", "溪", "狮", "瑞", "瑟", "硕", "算", "粹", "绸", "综", "绰", "绮", "翠", "菁", "菜", "菖", "裳", "认", "誓", "诵", "说",
                "诚", "轻", "菘", "造", "衔", "铨", "限", "需", "韶", "饲", "饰", "旗", "齐", "熏", "僦", "尝", "墅", "寨", "慎", "溯", "搴",
                "逢", "梦", "滑", "瑚", "珲", "碧", "福", "绵", "翡", "萍", "华", "菩", "蜜", "裴", "豪", "宾", "辅", "郝", "铭", "阀", "陌",
                "颇", "凤", "鸣", "榜", "槐", "滏", "宽", "广", "慷", "惯", "概", "瑰", "葛", "葵", "课", "逵", "郭", "稿", "靠", "溉", "锆",
                "俭", "著", "厉", "剧", "剑", "刘", "妖", "履", "帜", "弹", "徵", "德", "虑", "摘", "敌", "暂", "闾", "乐", "楼", "樟", "滴",
                "渐", "涨", "浆", "练", "缔", "蒂", "骀", "落", "董", "葶", "蝶", "调", "谆", "谈", "诋", "诤", "谅", "论", "质", "驼", "践",
                "轮", "逮", "进", "醇", "铝", "阵", "震", "霆", "驾", "驻", "稽", "稻", "稷", "节", "鲁", "黎", "侬", "涤", "墩", "幢", "嶙",
                "锻", "褚", "亿", "仪", "影", "慰", "忧", "样", "欧", "毅", "演", "渔", "熬", "熠", "熨", "瑶", "缘", "纬", "腰", "万", "叶",
                "苇", "谊", "逸", "邮", "阅", "院", "鞍", "颐", "养", "颍", "粗", "缓", "卫", "葳", "骑", "妩", "鉴", "署", "啸", "增", "婵",
                "审", "层", "厂", "厨", "厮", "庆", "摧", "数", "枢", "漆", "熟", "热", "线", "肠", "兴", "萱", "谁", "请", "贤", "赏", "赐",
                "趣", "娴", "醉", "锐", "销", "霄", "驷", "确", "磁", "穷", "箭", "箱", "竖", "辍", "漩", "箴", "绪", "翦", "葸", "罚", "划",
                "哗", "坟", "墨", "币", "庙", "废", "慧", "慕", "慢", "暮", "樊", "标", "模", "浒", "汉", "满", "漫", "漂", "玛", "编", "腹",
                "铺", "葆", "葡", "卖", "赋", "辉", "辈", "部", "锋", "陛", "盘", "码", "篇", "麾", "劈", "幡", "摩", "沪", "漠", "磐", "褒",
                "荭", "窥", "糕", "膏", "盖", "钢", "龟", "购", "器", "垦", "横", "橄", "篙", "馆", "尽", "坛", "导", "惮", "战", "撰", "历",
                "瞳", "昙", "暨", "橘", "洁", "潭", "瑾", "庐", "积", "筑", "蒸", "诸", "谛", "诺", "猪", "赖", "蹄", "辑", "道", "达", "都",
                "录", "锦", "锭", "陆", "陶", "陵", "霓", "霖", "静", "颊", "头", "雕", "疆", "腿", "臻", "赚", "骆", "俦", "橙", "润", "澈",
                "笃", "缙", "萤", "谓", "谒", "谙", "谕", "豫", "逾", "运", "阴", "赢", "蓉", "勋", "儒", "学", "宪", "熹", "憧", "晓", "桥",
                "樵", "橡", "树", "潮", "甑", "莳", "璇", "聪", "融", "亲", "谌", "谐", "遂", "醒", "钱", "错", "陈", "陲", "赛", "蓄", "苍",
                "侪", "澍", "莼", "铮", "锡", "阊", "桦", "壁", "奋", "播", "抚", "潘", "磨", "蒙", "衡", "谋", "讳", "讽", "辨", "锚", "陪",
                "默", "蒲", "蓓", "滨", "嬖", "凭", "颖", "馀", "恳", "桧", "糠", "阶", "瞰", "懂", "挡", "担", "据", "捡", "激", "浓", "烛",
                "璐", "矶", "磷", "绩", "联", "胶", "膛", "临", "举", "莲", "蔗", "蒋", "讲", "递", "辗", "镀", "钟", "键", "隆", "队", "骏",
                "黛", "点", "泽", "沣", "潞", "澄", "优", "婴", "屿", "狱", "应", "忆", "拥", "澳", "营", "蔚", "荫", "舆", "锾", "闱", "阳",
                "偿", "择", "擅", "操", "澡", "燧", "禧", "穗", "簇", "纵", "总", "声", "膝", "襄", "邹", "乡", "隋", "虽", "霞", "霜", "鲜",
                "戏", "鸿", "壕", "嫔", "弥", "篷", "缝", "韩", "蔓", "擘", "柜", "圹", "归", "缋", "蒉", "磬", "纩", "戴", "拟", "抬", "挤",
                "爵", "涛", "礼", "简", "粮", "职", "旧", "蕉", "谨", "转", "遮", "题", "镇", "储", "藜", "芷", "迟", "鲤", "翼", "讴", "医",
                "隘", "额", "瑷", "莸", "镒", "隗", "彝", "潍", "丛", "曙", "湿", "织", "萧", "蕊", "蝉", "适", "锁", "垒", "断", "柠", "泞",
                "槟", "环", "蕃", "庞", "璧", "馥", "扩", "关", "铿", "祷", "荐", "勒", "襟", "谭", "证", "轿", "辽", "邻", "郑", "邓", "类",
                "鲸", "丽", "麓", "镜", "觉", "际", "橹", "栎", "泺", "辚", "链", "韵", "稳", "薏", "薇", "膺", "臆", "蚁", "袄", "遗", "雾",
                "艳", "蓣", "蕹", "韫", "玺", "薛", "薪", "绳", "蟹", "识", "赞", "遵", "迁", "选", "渖", "谯", "镟", "锵", "镞", "铲", "颡",
                "鹑", "暹", "攀", "簿", "绘", "鹏", "瀑", "宝", "祢", "薜", "谱", "镆", "镘", "矿", "阚", "岿", "藉", "蓝", "拢", "沥", "泷",
                "竞", "篮", "罗", "舰", "警", "露", "腾", "党", "枥", "槠", "滤", "濑", "窦", "笞", "筹", "镦", "荩", "严", "瀛", "耀", "译",
                "议", "邀", "懿", "萨", "藏", "薰", "壤", "悬", "曦", "脐", "馨", "释", "献", "坏", "孀", "籍", "谵", "锈", "怀", "瀚", "缤",
                "还", "迈", "飘", "膑", "朦", "濒", "铧", "顾", "钚", "俪", "栏", "铁", "鸡", "镯", "藤", "览", "镭", "铎", "铛", "斓", "樱",
                "艺", "藕", "誉", "跃", "迩", "莺", "险", "续", "随", "属", "攘", "茑", "藩", "轰", "辩", "癖", "霸", "鹤", "灌", "垄", "叠",
                "笼", "听", "芦", "读", "铸", "籁", "苈", "蔼", "隐", "璎", "蕴", "鳙", "欢", "边", "鳗", "镔", "镬", "恋", "兰", "滩", "铄",
                "鳞", "驿", "验", "缨", "显", "钻", "变", "蘩", "罐", "赣", "雳", "灵", "陇", "酿", "鹰", "霭", "坝", "观", "戆", "厅", "篱",
                "钥", "镶", "黉", "颢", "逻", "驴", "湾", "灒", "銮", "骥", "骧", "鹦", "鹳", "吁"
            };
            _gongsi = new[]
            {
                "广告有限公司", "软件有限公司", "花卉有限公司", "窗饰有限公司", "园艺有限公司", "绿化有限公司", "化妆品有限公司", "商务咨询有限公司", "投资咨询有限公司",
                "企业管理有限公司",
                "投资管理有限公司", "信息科技有限公司", "文化传播有限公司", "信息技术有限公司", "网络科技有限公司", "网络工程有限公司", "软件技术有限公司", "电子技术有限公司",
                "电子科技有限公司", "数码科技有限公司", "渗透技术有限公司", "自控技术有限公司", "电梯工程有限公司", "机电设备有限公司", "机械科技有限公司", "机械密封有限公司",
                "机电科技有限公司", "光电科技有限公司", "电力科技有限公司", "通讯科技有限公司", "通讯技术有限公司", "化学科技有限公司", "传动机械有限公司", "电脑租赁有限公司",
                "建筑设计有限公司", "建筑装潢有限公司", "装潢设计有限公司", "建筑安装有限公司", "智能科技有限公司", "景观设计有限公司", "门业装饰有限公司", "制冷工程有限公司",
                "展览服务有限公司", "会务服务有限公司", "快递服务有限公司", "数码动画有限公司", "婚庆服务有限公司", "礼仪服务有限公司", "翻译服务有限公司", "船舶配件有限公司",
                "船舶技术有限公司", "环保科技有限公司", "真空涂装有限公司", "化工技术有限公司", "化工科技有限公司", "超声波技术有限公司", "智能化科技有限公司", "计算机科技有限公司",
                "企业管理咨询有限公司", "企业形象策划有限公司", "市场营销策划有限公司", "信息技术工程有限公司", "机电工程技术有限公司", "机电设备工程有限公司", "精密设备科技有限公司",
                "金属结构工程有限公司", "建筑工程技术有限公司", "装饰设计工程有限公司", "建筑装饰工程有限公司", "微电子工程技术有限公司", "展览展示服务有限公司", "建筑装潢设计工程有限公司",
                "工业产品设计有限公司", "贸易有限公司", "五金配件有限公司", "实业有限公司", "制冷设备有限公司", "服装有限公司", "厨房设备有限公司", "环保设备有限公司", "家具有限公司",
                "电缆附件有限公司", "门业有限公司", "墙体材料有限公司", "管业有限公司", "办公设备有限公司", "涂料有限公司", "自控仪器有限公司", "玻璃有限公司", "塑料制品有限公司",
                "鞋业有限公司", "实业发展有限公司", "箱包有限公司", "日用百货有限公司", "卫浴有限公司", "电子仪器有限公司", "商贸有限公司", "电子设备有限公司", "服饰有限公司",
                "阀门有限公司", "机电工程有限公司", "家居用品有限公司", "电器有限公司", "包装材料有限公司", "泵业有限公司", "工艺礼品有限公司", "五金有限公司", "汽车服务有限公司",
                "瓷业有限公司", "机械材料有限公司", "刀具有限公司", "汽车租赁有限公司", "布艺有限公司", "汽摩配件有限公司", "化纤有限公司", "自动化设备有限公司", "粘合剂有限公司",
                "管道设备工程有限公司", "不锈钢有限公司", "空调制冷设备有限公司", "润滑油有限公司", "轻工机械设备有限公司"
            };
        }

        /// <summary>
        ///     获取一个随机公司后缀
        /// </summary>
        /// <returns></returns>
        public static string GetCompany()
        {
            if (_xing == null)
                Init2();
            var str = _gongsi[R.Next(0, _gongsi.Length)];
            return str;
        }

        /// <summary>
        ///     获取一个随机人名
        /// </summary>
        /// <returns></returns>
        public static string GetChineseName()
        {
            if (_xing == null)
                Init2();
            string str;
            if (R.Next(0, 3) == 0)
            {
                str = _xing[R.Next(0, _xing.Length)] + _ming[R.Next(0, _ming.Length)];
            }
            else
            {
                str = _xing[R.Next(0, _xing.Length)] + _ming[R.Next(0, _ming.Length)] + _ming[R.Next(0, _ming.Length)];
            }
            return str;
        }

        /// <summary>
        ///     获取一个人名（不含姓）
        /// </summary>
        /// <returns></returns>
        public static string GetChineseFirstName()
        {
            if (_xing == null)
                Init2();
            string str;

            str = _ming[R.Next(0, _ming.Length)] + _ming[R.Next(0, _ming.Length)];

            return str;
        }

        /// <summary>
        ///     获取一个姓（不含名）
        /// </summary>
        /// <returns></returns>
        public static string GetChineseLastName()
        {
            if (_xing == null)
                Init2();

            var str = _xing[R.Next(0, _xing.Length)];

            return str;
        }

        #endregion

        #region 英文相关

        private static string[] _abc;

        private static void Init3()
        {
            _abc = new[]
            {
                "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u",
                "v", "w", "x", "y", "z"
            };
        }

        /// <summary>
        ///     获取英文字符串
        /// </summary>
        /// <param name="leg">长度</param>
        /// <param name="isUpper">是否大写</param>
        /// <returns></returns>
        public static string GetEngStr(int leg, bool isUpper)
        {
            if (_abc == null)
                Init3();
            var str = "";
            for (var i = 0; i < leg; i++)
            {
                str += _abc[R.Next(0, _abc.Length)];
            }
            return isUpper ? str.ToUpper() : str;
        }

        /// <summary>
        ///     返回随机数字
        /// </summary>
        /// <param name="min">最小</param>
        /// <param name="max">最大</param>
        /// <returns></returns>
        public static int GetNumber(int min, int max)
        {
            return R.Next(max > min ? min : max - 1, max);
        }

        #endregion
    }
}